local raceAlliance = {[225]=7,[177]=1,[178]=1,[203]=20,[455]=3,[406]=6,[382]=2,[351]=2,[285]=5,[363]=1,[237]=4,[429]=2,[280]=6,[279]=4,[417]=1,[364]=4,[400]=1,[345]=1,[459]=5,[394]=2,[297]=4,[462]=24,[207]=5,[333]=2,[216]=2,[387]=2,[250]=6,[424]=6,[357]=4,[298]=13,[231]=1,[388]=2,[327]=5,[430]=4,[334]=2,[346]=4,[255]=4,[274]=4,[412]=1,[370]=6,[260]=4,[376]=3,[273]=1,[286]=1,[219]=17,[352]=6,[244]=4,[375]=2,[238]=6,[445]=13,[399]=1,[439]=1,[405]=2,[292]=4,[202]=1,[393]=5,[340]=2,[303]=2,[328]=1,[440]=4,[267]=6,[194]=19,[460]=12,[232]=4,[411]=3,[304]=4,[358]=4,[452]=3,[381]=5,[249]=4,[224]=23,[218]=23,[423]=4,[291]=1,[266]=4,[446]=1,[193]=15,[451]=3,[243]=2,[261]=6,[256]=6,[458]=5,[339]=5,[418]=4,[369]=4,[342]=1,[209]=8,[227]=1,[204]=1,[208]=5,[91]=5,[395]=1,[184]=5,[92]=1,[341]=1,[347]=1,[179]=5,[87]=1,[287]=1,[390]=5,[107]=5,[326]=2,[235]=5,[288]=3,[189]=18,[230]=6,[447]=2,[444]=3,[371]=2,[153]=2,[254]=6,[365]=3,[295]=11,[408]=6,[271]=2,[262]=4,[401]=2,[360]=6,[434]=21,[385]=2,[368]=1,[377]=2,[32]=15,[463]=4,[276]=1,[413]=1,[258]=6,[265]=6,[96]=4,[427]=3,[431]=2,[350]=3,[301]=2,[379]=2,[354]=4,[115]=2,[441]=2,[410]=6,[398]=1,[323]=2,[277]=5,[289]=2,[450]=4,[335]=5,[426]=2,[384]=2,[93]=3,[180]=6,[89]=2,[436]=13,[299]=5,[270]=6,[330]=1,[383]=5,[397]=2,[88]=3,[211]=2,[170]=17,[245]=4,[113]=2,[110]=2,[449]=4,[119]=13,[294]=6,[403]=2,[236]=2,[343]=2,[453]=2,[402]=3,[263]=4,[331]=5,[248]=6,[190]=1,[97]=2,[355]=2,[419]=2,[396]=1,[374]=4,[105]=1,[359]=1,[253]=4,[386]=13,[416]=4,[432]=13,[112]=4,[414]=6,[284]=4,[407]=3,[392]=5,[448]=22,[283]=1,[247]=4,[361]=4,[192]=12,[348]=3,[421]=5,[442]=3,[269]=1,[373]=1,[102]=1,[157]=7,[422]=1,[391]=5,[356]=6,[118]=13,[332]=5,[437]=13,[338]=5,[362]=3,[106]=1,[103]=1,[272]=4,[438]=2,[154]=1,[239]=5,[329]=1,[372]=2,[114]=5,[302]=1,[94]=1,[233]=3,[155]=5,[443]=5,[228]=6,[117]=1,[415]=2,[409]=6,[337]=1,[95]=4,[290]=4,[275]=2,[349]=5,[109]=5,[98]=4,[111]=2,[378]=2,[325]=2,[366]=13,[242]=1,[176]=5,[171]=16,[34]=4,[264]=4,[252]=6,[185]=5,[212]=5,[159]=5,[324]=1,[300]=1,[99]=6,[101]=4,[380]=2,[183]=7,[246]=6,[404]=3,[259]=6,[435]=1,[268]=4,[90]=3,[251]=6,[428]=1,[296]=2,[234]=3,[182]=1,[425]=5,[293]=3,[344]=13,[172]=1,[205]=5,[281]=2,[120]=13,[420]=13,[116]=4,[108]=6,[367]=3,[241]=2,[336]=1,[217]=4,[229]=2,[282]=13,[353]=1,[278]=2,[186]=5,[100]=6,[195]=1,[104]=6,[257]=4,[433]=13,[240]=1,[389]=5,[168]=14}
local raceHorde = {[225]=7,[177]=1,[178]=1,[203]=20,[455]=3,[406]=12,[382]=7,[351]=8,[285]=7,[363]=7,[237]=7,[429]=13,[280]=12,[279]=8,[417]=7,[364]=7,[400]=7,[345]=10,[459]=7,[394]=7,[297]=8,[462]=24,[207]=11,[333]=9,[216]=10,[387]=12,[250]=9,[424]=12,[357]=12,[298]=12,[231]=11,[388]=9,[327]=11,[430]=9,[334]=9,[346]=8,[255]=8,[274]=9,[412]=11,[370]=12,[260]=9,[376]=11,[273]=7,[286]=9,[219]=17,[352]=10,[244]=9,[375]=8,[238]=12,[445]=7,[399]=7,[439]=7,[405]=12,[292]=7,[202]=1,[393]=7,[340]=9,[303]=12,[328]=9,[440]=13,[267]=8,[194]=19,[460]=12,[232]=9,[411]=8,[304]=11,[358]=11,[452]=8,[381]=9,[249]=9,[224]=23,[218]=23,[423]=7,[291]=7,[266]=9,[446]=9,[193]=15,[451]=13,[243]=8,[261]=9,[256]=8,[458]=7,[339]=11,[418]=9,[369]=12,[342]=1,[209]=8,[227]=7,[204]=10,[208]=5,[91]=10,[395]=11,[184]=7,[92]=7,[341]=10,[347]=10,[179]=7,[87]=7,[287]=7,[390]=8,[107]=11,[326]=9,[235]=11,[288]=10,[189]=18,[230]=7,[447]=10,[444]=8,[371]=10,[153]=7,[254]=8,[365]=7,[295]=11,[408]=10,[271]=10,[262]=9,[401]=7,[360]=11,[434]=21,[385]=8,[368]=11,[377]=7,[32]=15,[463]=10,[276]=8,[413]=7,[258]=9,[265]=8,[96]=8,[427]=9,[431]=7,[350]=9,[301]=8,[379]=13,[354]=10,[115]=11,[441]=9,[410]=10,[398]=11,[323]=9,[277]=11,[289]=10,[450]=10,[335]=11,[426]=7,[384]=9,[93]=8,[180]=8,[89]=12,[436]=13,[299]=11,[270]=10,[330]=11,[383]=8,[397]=10,[88]=7,[211]=12,[170]=17,[245]=9,[113]=12,[110]=9,[449]=13,[119]=13,[294]=8,[403]=11,[236]=9,[343]=9,[453]=10,[402]=8,[263]=8,[331]=11,[248]=8,[190]=1,[97]=10,[355]=8,[419]=10,[396]=7,[374]=8,[105]=11,[359]=7,[253]=9,[386]=7,[416]=12,[432]=13,[112]=11,[414]=11,[284]=10,[407]=10,[392]=12,[448]=22,[283]=11,[247]=8,[361]=11,[192]=12,[348]=11,[421]=11,[442]=8,[269]=7,[373]=10,[102]=10,[157]=7,[422]=9,[391]=12,[356]=11,[118]=13,[332]=9,[437]=13,[338]=11,[362]=10,[106]=11,[103]=10,[272]=13,[438]=10,[154]=11,[239]=13,[329]=9,[372]=10,[114]=10,[302]=11,[94]=10,[233]=9,[155]=7,[443]=11,[228]=12,[117]=10,[415]=10,[409]=8,[337]=11,[95]=12,[290]=13,[275]=9,[349]=13,[109]=7,[98]=9,[111]=7,[378]=9,[325]=9,[366]=8,[242]=10,[176]=7,[171]=16,[34]=9,[264]=9,[252]=8,[185]=7,[212]=7,[159]=7,[324]=9,[300]=10,[99]=8,[101]=8,[380]=8,[183]=7,[246]=8,[404]=8,[259]=8,[435]=7,[268]=9,[90]=11,[251]=8,[428]=10,[296]=7,[234]=8,[182]=7,[425]=10,[293]=8,[344]=8,[172]=1,[205]=5,[281]=7,[120]=13,[420]=8,[116]=11,[108]=8,[367]=13,[241]=10,[336]=11,[217]=9,[229]=10,[282]=12,[353]=9,[278]=9,[186]=7,[100]=9,[195]=10,[104]=11,[257]=9,[433]=13,[240]=7,[389]=12,[168]=14}
local race = ((UnitFactionGroup("player"))=="Alliance") and raceAlliance or raceHorde
local raceName

if GetLocale() == "zhCN" then
	raceName = {"人类","矮人","侏儒","暗夜精灵","德莱尼","狼人","兽人","巨魔","牛头人","亡灵","血精灵","地精","熊猫人","埃匹希斯守卫","食人魔","机械","刃牙虎人","独眼魔","林精","豺狼人","锦鱼人","猢狲","鸦人流亡者","高等鸦人"};
elseif GetLocale() == "zhTW" then
	raceName = {"人類","矮人","地精","夜精靈","德萊尼","狼人","獸人","食人妖","牛頭人","不死族","血精靈","哥布林","熊貓人","頂尖守護者","巨魔","機械","劍齒人","歐格隆","波塔尼","豺狼人","錦魚人","猴人","阿拉卡流亡者","高等阿拉卡人"};
else
	raceName = {"Human","Dwarf","Gnome","Night Elf","Draenei","Worgen","Orc","Troll","Tauren","Undead","Blood Elf","Goblin","Pandaren","Apexis Guardian","Ogre","Mechanical","Saberon","Ogron","Botani","Gnoll","Jinyu","Hozen","Outcast Arakkoa","High Arakkoa"};
end

local function GetRetruitLink(index)
	local follower = C_Garrison.GetAvailableRecruits()[index];
	local link;
	local lvl = follower.level;
	local iLvl = follower.iLevel
	local id = follower.followerID;
	local quality = follower.quality;
	local name = follower.name;
	local abilities = {0, 0, 0, 0};
	local traits = {0, 0, 0, 0};
	local color = ITEM_QUALITY_COLORS[quality].hex
	
	local abilityIndex = 0;
	local traitIndex = 0;
	
	for _, ability in pairs(C_Garrison.GetRecruitAbilities(index)) do
		if not ability.isTrait then
			abilityIndex = abilityIndex + 1;
			abilities[abilityIndex] = ability.id;
		else
			traitIndex = traitIndex + 1;
			traits[traitIndex] = ability.id;
		end
	end
	
	link = string.format("%s|Hgarrfollower:%d:%d:%d:%d", color, id, quality, lvl, iLvl);
	for i= 1, 4 do
		link = link .. ":" .. abilities[i];
	end
	for i= 1, 4 do
		link = link .. ":" .. traits[i];
	end
	link = string.format("%s|h[%s]|h|r", link, name);
	
	return link;
end

local function Link_OnClick(self)
	if not IsModifiedClick("CHATLINK") then
		return
	end
	
	local frame = self:GetParent();
	local index = frame.index;
	
	local link = GetRetruitLink(index);
	local editBox
	
	for i = 1, NUM_CHAT_WINDOWS do
		editBox = _G[format("%s%d%s", "ChatFrame", i, "EditBox")];
		if editBox:IsShown() then
			editBox:Insert(link);
		end
	end
end

local function ShowRecruitInfo(waiting)
	if waiting then 
		return 
	end

	local followers = C_Garrison.GetAvailableRecruits();
	local id, frame, btn;
	local color = NORMAL_FONT_COLOR;
	if next(followers) ~= nil then
		for i = 1, 3 do
			id = followers[i].followerID;
			frame = GarrisonRecruitSelectFrame.FollowerSelection["Recruit"..i];
			
			frame.race = frame.race or frame:CreateFontString(nil, "ARTWORK", "GameFontHighlight");
			frame.class = frame.class or frame:CreateFontString(nil, "ARTWORK", "GameFontHighlight");
			
			frame.race:SetText(raceName[race[id]]);
			frame.class:SetText(followers[i].className);
			
			frame.race:SetPoint("TOPLEFT", frame.PortraitFrame, "BOTTOMLEFT", 8, -5);
			frame.class:SetPoint("TOPLEFT", frame.race, "BOTTOMLEFT", 0 , 0);
			
			if frame.Abilities:IsShown() then
				frame.Abilities:SetPoint("TOPLEFT", frame.class, "BOTTOMLEFT", 0 , -5);
				if frame.Traits:IsShown() then
					frame.Traits:SetPoint("TOPLEFT", frame.Abilities, "BOTTOMLEFT", 0 , 0);
				end
			else
				frame.Traits:SetPoint("TOPLEFT", frame.class, "BOTTOMLEFT", 0 , -5);
			end
			
			frame.class:SetVertexColor(color.r, color.g, color.b);
			
			frame.race:Show();
			frame.class:Show();
			frame.index = i;
			
			if not frame.btnLink then
				btn = CreateFrame("Button", nil, frame, "UIPanelButtonTemplate");
				btn:SetPoint("TOPLEFT", frame, "TOPLEFT", 0, 0);
				btn:SetWidth(188);
				btn:SetHeight(50);
				btn:SetScript("OnClick", Link_OnClick);
				btn:SetAlpha(0.0);
				frame.btnLink = btn;
			end
		end
	end
end

hooksecurefunc("GarrisonRecruitSelectFrame_UpdateRecruits", ShowRecruitInfo)