DraenorTreasures = LibStub("AceAddon-3.0"):NewAddon("DraenorTreasures", "AceBucket-3.0", "AceConsole-3.0", "AceEvent-3.0", "AceTimer-3.0")

local HandyNotes = LibStub("AceAddon-3.0"):GetAddon("HandyNotes", true)
if not HandyNotes then return end

local iconDefaults = {
default = "Interface\\Icons\\TRADE_ARCHAEOLOGY_CHESTOFTINYGLASSANIMALS",
unknown = "Interface\\Addons\\HandyNotes_DraenorTreasures\\Artwork\\chest_normal_daily.tga",
hundredrare = "Interface\\Addons\\HandyNotes_DraenorTreasures\\Artwork\\RareIconBlue.tga",
rare = "Interface\\Addons\\HandyNotes_DraenorTreasures\\Artwork\\RareIcon.tga",
swprare = "Interface\\Icons\\Trade_Archaeology_Fossil_SnailShell",
shrine = "Interface\\Icons\\inv_misc_statue_02",
glider = "Interface\\Icons\\inv_feather_04",
rocket = "Interface\\Icons\\ability_mount_rocketmount",
}
PlayerFaction, _ = UnitFactionGroup("player")
DraenorTreasures.nodes = { }
local nodes = DraenorTreasures.nodes
local isTomTomloaded = false

if (IsAddOnLoaded("TomTom")) then 
	isTomTomloaded = true
end

nodes["ShadowmoonValleyDR"] = {
--SMV 財寶
[55004500]={ "35581", "煉金師的包裹", "草藥", "", "default", "SMVTreasures","109124"},
[52834837]={ "35584", "先祖巨斧", "i519 雙手 力量斧", "", "default", "SMVTreasures","113560"},
[41502790]={ "33869", "裝甲雷象獠牙", "i518 飾品 護甲加成+精通 使用後", "", "default", "SMVTreasures","108902"},
[37704430]={ "33584", "阿庫伯的灰燼", "休息獎勵經驗值的消耗品", "", "default", "SMVTreasures","113531"},
[49303750]={ "33867", "占星家的盒子", "玩具", "", "default", "SMVTreasures","109739"},
[36804140]={ "33046", "愛人的祭品", "趣味物品 - 副手", "", "default", "SMVTreasures","113547"},
[37202310]={ "33613", "冒泡的大鍋", "i516 法術 副手", "在一個山洞內; 入口在略向東北的方位, 座標：38, 22.3", "default", "SMVTreasures","108945"},
[84504470]={ "33885", "渡鴉女皇的貨物", "要塞資源", "", "default", "SMVTreasures","824"},
[33503970]={ "33569", "雕飾飲水角", "可重複使用的法力藥水", "", "default", "SMVTreasures","113545"},
[61706790]={ "34743", "托瓦斯的水晶之刃", "垃圾物品", "與物件互動導致三銀葉古樹出現 ；在他們都死了以後你才能拾取物品。", "default", "SMVTreasures","111636"},
[20303060]={ "33575", "惡魔寶箱", "i550 智力 項鍊", "", "default", "SMVTreasures","108904"},
[29853748]={ "36879", "滿是灰塵的寶箱", "隨機裝綁綠裝", "", "default", "SMVTreasures","824"},
[51803550]={ "33037", "帶夾層的罐子", "金錢", "", "default", "SMVTreasures","824"},
[26500570]={ "34174", "神奇魚", "要塞資源", "", "default", "SMVTreasures","824"},
[34404620]={ "33891", "巨型月柳球果", "i522 魔杖", "", "default", "SMVTreasures","108901"},
[48704750]={ "35798", "發光的洞穴蘑菇", "草藥", "", "default", "SMVTreasures","109130"},
[38504300]={ "33614", "格瑞卡的罈子", "i528 飾品 加速 + 力量 觸發", "", "default", "SMVTreasures","113408"},
[47104610]={ "33564", "掛起的背包", "i518 敏捷/智力 皮甲手套", "", "default", "SMVTreasures","108900"},
[42106130]={ "33041", "鋼鐵部落貨箱", "要塞資源", "", "default", "SMVTreasures","824"},
[37505930]={ "33567", "鋼鐵部落貢品", "飾品 雙擊 + DMG 使用後", "", "default", "SMVTreasures","108903"},
[57904530]={ "33568", "卡利鳥蛋", "25 要塞資源", "", "default", "SMVTreasures","113271"},
[58902200]={ "35603", "米卡爾的箱子", "垃圾物品", "大多只是針對經驗值", "default", "SMVTreasures","113215"},
[52902490]={ "37254", "長滿蘑菇的寶箱", "25 要塞資源", "", "default", "SMVTreasures","113388"},
[66903350]={ "36507", "獸人骷髏", "i526 力量 戒指", "", "default", "SMVTreasures","116875"},
[43806060]={ "33611", "和平祭禮 1", "垃圾物品", "", "default", "SMVTreasures","107650"},
[45206050]={ "33610", "和平祭禮 2", "垃圾物品", "", "default", "SMVTreasures","107650"},
[44506350]={ "33384", "和平祭禮 3", "垃圾物品", "", "default", "SMVTreasures","107650"},
[44505920]={ "33612", "和平祭禮 4", "垃圾物品", "", "default", "SMVTreasures","107650"},
[31303910]={ "33886", "羅諾克的物品", "i522 力量 披風", "", "default", "SMVTreasures","109081"},
[22803390]={ "33572", "腐朽的籃子", "垃圾物品", "在血棘洞穴內", "default", "SMVTreasures","113373"},
[36704450]={ "33573", "羅沃的匕首", "i520 敏捷匕首", "", "default", "SMVTreasures","113378"},
[67108430]={ "33565", "帶鱗片的雙頭飛龍蛋", "垃圾物品", "!!! 等級100區域 !!!", "default", "SMVTreasures","44722"},
[45802460]={ "33570", "影月流亡者寶箱", "25 要塞資源", "在一個山洞內 升起的流亡者下面", "default", "SMVTreasures","113388"},
[30004530]={ "35919", "影月祭祀匕首", "i524 法術匕首", "", "default", "SMVTreasures","113563"},
[28303930]={ "33883", "影月寶藏", "要塞資源", "", "default", "SMVTreasures","824"},
[27100260]={ "35280", "失竊的寶藏", "要塞資源", "", "default", "SMVTreasures","824"},
[55801990]={ "35600", "奇異孢子", "寵物", "在巨大蘑菇的頂部", "default", "SMVTreasures","118104"},
[37202610]={ "35677", "沉沒的漁船", "趣味物品 - 關於釣魚", "", "default", "SMVTreasures","110506"},
[28800710]={ "35279", "沉沒的寶箱", "要塞資源", "", "default", "SMVTreasures","824"},
[55307480]={ "35580", "沼澤熒光蟲蜂巢", "玩具", "", "default", "SMVTreasures","117550"},
[35904090]={ "33540", "烏茲克的小玩意兒", "i525 敏捷/智力 皮甲鞋", "", "default", "SMVTreasures","113546"},
[34204350]={ "33866", "威瑪的草藥包", "草藥", "", "default", "SMVTreasures","109124"},
[51107910]={ "33574", "守備官寶箱", "玩具", "!!! 等級100區域 !!!", "default", "SMVTreasures","113375"},
[39208380]={ "33566", "進水的寶箱", "i520 力量 拳套 + 要塞資源", "", "default", "SMVTreasures","113372"},
--SMVRares
[37203640]={ "33061", "阿莫卡瓦", "i516 敏捷/智力 鎖甲胸", "在一大片區域附近飛行", "rare", "SMVRares","109060"},
[50807880]={ "37356", "阿誇利亞", "i620 智力 戒指", "!!! 等級101 !!!", "hundredrare", "SMVHundred","119387"},
[68208480]={ "37410", "雪崩", "i620 力量 單手錘", "!!! 等級100 !!!", "hundredrare", "SMVHundred","823"},
[52801680]={ "35731", "巴魯恩", "無增益的重複性食物", "", "rare", "SMVRares","113540"},
[43807740]={ "33383", "藤王菲利", "i620 敏捷法杖", "!!! 等級100 !!!", "hundredrare", "SMVHundred","117551"},
[48604360]={ "33064", "暗影餘孽", "i516 智力拳套", "在一個山洞裡；殺了邪教徒們才能攻擊 ", "rare", "SMVRares","109075"},
[41008300]={ "35448", "黑暗大師高維德", "i525 智力法杖 + Lobstrok 夥伴", "", "rare", "SMVRares","113548"},
[49604200]={ "35555", "暗爪", "i520 敏捷 披風", "", "rare", "SMVRares","113541"},
[46007160]={ "37351", "德米多斯", "頂尖水晶", "!!! 等級102 !!!", "hundredrare", "SMVHundred","823"},
[67806380]={ "35688", "愛娜瓦拉", "i523 智力項鍊", "與他的屍體互動然後出現靈魂開始攻擊", "rare", "SMVRares","113556"},
[61606180]={ "35725", "靈光", "i526 敏捷/智力 皮甲腿", "", "rare", "SMVRares","113557"},
[37404880]={ "35558", "催眠魔蛙", "玩具", "", "rare", "SMVRares","113631"},
[57404840]={ "35909", "伊沙塔爾", "i520 敏捷/智力 鎖甲鞋", "", "rare", "SMVRares","113571"},
[40804440]={ "33043", "戮顎", "i516 敏捷匕首", "", "rare", "SMVRares","109078"},
[32203500]={ "33039", "虛空先知庫塔格", "i516 敏捷/智力 鎖甲手套", "", "rare", "SMVRares","109061"},
[48007760]={ "37355", "魔女泰普特莎", "i620 敏捷/智力 皮甲鞋", "!!! 等級101 !!!", "hundredrare", "SMVHundred","119360"},
[37601460]={ "33055", "讀葉者庫裡", "i518 飾品 臨機應變 + 治療 觸發", "", "rare", "SMVRares","108907"},
[44802080]={ "35906", "“瘋王”斯波隆", "i519 敏捷法杖", "", "rare", "SMVRares","113561"},
[29605080]={ "37357", "馬爾格許·影衛", "i620 敏捷/智力 鎖甲頭盔", "!!! 等級100 !!!", "hundredrare", "SMVHundred","119369"},
[51807920]={ "37353", "軍士長米格拉", "i620 敏捷/智力 鎖甲手套", "!!! 等級101 !!!", "hundredrare", "SMVHundred","119368"},
[38607020]={ "35523", "莫爾瓦·屈魂者", "i520 單手 法術錘", "", "rare", "SMVRares","113559"},
[44005760]={ "33642", "主母奧姆拉", "i522 飾品 智力 +精通 觸發", "殺了邪教徒們才能攻擊他", "rare", "SMVRares","113527"},
[58408680]={ "37409", "奈吉德納", "未知", "!!! 等級100 !!! 在山洞內 - 入口在 59,89", "hundredrare", "SMVHundred",""},
[50207240]={ "37352", "軍需官赫沙克", "i620 力量/智力 鎧甲腿", "!!! 等級101 !!!", "hundredrare", "SMVHundred","823"},
[48602260]={ "35553", "萊沃什", "重複性緩落物品", "", "rare", "SMVRares","113542"},
[53005060]={ "34068", "岩蹄", "i516 力量盾", "", "rare", "SMVRares","109077"},
[48208100]={ "37354", "暗影語者納爾", "i620 法術匕首", "!!! 等級101 !!!", "hundredrare", "SMVHundred","823"},
[61005520]={ "35732", "真理", "400% 有CD的陸地坐騎", "在一個大區域漫遊-經常逃避和消失", "rare", "SMVRares","113543"},
[61408880]={ "37411", "裂喉", "i620 力量 雙手劍", "!!! 等級100 !!!", "hundredrare", "SMVHundred","119411"},
[27604360]={ "36880", "斯尼維爾", "i519 布甲腿", "", "rare", "SMVRares","118734"},
[21602100]={ "33640", "維洛斯", "i516 智力 戒指", "", "rare", "SMVRares","108906"},
[54607060]={ "33643", "毒葵", "i516 敏捷/智力 皮甲鞋", "", "rare", "SMVRares","108957"},
[31905720]={ "37359", "虛空掠奪者烏奈", "i620 敏捷 單手斧", "!!! 等級100 !!!", "hundredrare", "SMVHundred","119392"},
[32604140]={ "35847", "虛空先知卡魯格", "i516 布甲腰", "殺了邪教徒們才能攻擊他", "rare", "SMVRares","109074"},
[48806640]={ "33389", "伊格德雷", "玩具", "", "rare", "SMVRares","113570"},
[29405150]={ "37357", "馬爾格許·影衛", "i620 敏捷/智力 鎧甲頭盔", "!!! 等級100!!!", "hundredrare", "SMVHundred","119369"},
}
nodes["FrostfireRidge"] = {
--FFRTreasures
[23102500]={ "33916", "競技場大師的作戰號角", "玩具", "在競技場的看台上", "default", "FFRTreasures","108735"},
[24242712]={ "33501", "競技場觀眾的箱子", "酒精飲料", "在石牌坊的頂部;從附近的塔頂部跳到它", "default", "FFRTreasures","63293"},
[61904254]={ "33511", "吞噬者布洛克", "i516 智力盾", "餵牠20個食人魔才能得到", "default", "FFRTreasures","112110"},
[42401970]={ "34520", "燃燒的珍珠", "i525 飾品 雙擊 +精通 觸發", "!!! 等級100區域 !!!", "default", "FFRTreasures","120341"},
[50201860]={ "33531", "Clumsy Cragmaul Brute", "i516 敏捷/智力 鎖甲頭盔", "!!! 等級100區域 !!!", "default", "FFRTreasures","112096"},
[42663175]={ "33940", "攀岩者的寶箱", "i516 敏捷/智力 鎖甲鞋", "跳上刺在牆上的長矛，才能到達", "default", "FFRTreasures","112187"},
[40902010]={ "34473", "特使的袋子", "垃圾物品", "!!! 等級100區域 !!!", "default", "FFRTreasures","110536"},
[43705550]={ "34841", "被遺忘的補給品", "要塞資源", "", "default", "FFRTreasures","824"},
[24204860]={ "34507", "冰封的霜狼戰斧", "i516 法強斧", "", "default", "FFRTreasures","110689"},
[57105210]={ "34476", "冰封的獸人骷髏 ", "i516 飾品精通 + 寵物 觸發", "", "default", "FFRTreasures","111554"},
[25502040]={ "34648", "啃過的骨頭", "i516 敏捷匕首", "", "default", "FFRTreasures","111415"},
[66702640]={ "33948", "鬣蜥人殘渣", "25 要塞資源", "!!! 等級100區域 !!! 在山頂的一個洞穴裡，向上的路徑開始於：69.3/24 ", "default", "FFRTreasures","111543"},
[68204580]={ "33947", "肅霜寶箱", "要塞資源", "", "default", "FFRTreasures","824"},
[56707180]={ "36863", "鋼鐵部落軍需品", "要塞資源", "", "default", "FFRTreasures","824"},
[69006910]={ "33017", "鋼鐵部落補給品", "要塞資源", "", "default", "FFRTreasures","824"},
[21900960]={ "33926", "環礁池塘", "玩具", "需要釣魚", "default", "FFRTreasures","108739"},
[19201200]={ "34642", "幸運硬幣", "趣味物品 - 金錢 Coin", "Sells for 25g", "default", "FFRTreasures","111408"},
[38303782]={ "33502", "黑曜石岩畫", "黑曜石 霜狼石刻", "獎勵5%休息經驗值的消耗品; 在山上，向上的路徑開始於：39/42.5", "default", "FFRTreasures","112087"},
[28296663]={ "34470", "白鬼魚販", "魚", "", "default", "FFRTreasures","111666"},
[21685076]={ "34931", "一袋白鬼戰利品", "要塞資源", "", "default", "FFRTreasures","824"},
[37205920]={ "34967", "搶來的戰利品", "要塞資源", "", "default", "FFRTreasures","824"},
[09804540]={ "34641", "密封的罐子", "趣味物品 - 箴言", "", "default", "FFRTreasures","111407"},
[27604280]={ "33500", "奴隸的寶貝", "酒精飲料", "", "default", "FFRTreasures","43696"},
[24001300]={ "34647", "積雪覆蓋的保險箱", "要塞資源", "", "default", "FFRTreasures","824"},
[16104980]={ "33942", "遺棄的補給品", "要塞資源", "", "default", "FFRTreasures","824"},
[64702570]={ "33946", "生存專家的寶箱", "要塞資源", "", "default", "FFRTreasures","824"},
[34202350]={ "32803", "雷神儲備點", "要塞資源", "", "default", "FFRTreasures","824"},
[64406580]={ "33505", "震動的蛋", "寵物", "", "default", "FFRTreasures","112107"},
[54803560]={ "33525", "年輕的獸人旅行者", "未知", "您需要收集部份的年輕的女獸人和年輕的獸人旅行者來完成這個", "default", "FFRTreasures","112206"},
[63401480]={ "33525", "年輕的女獸人", "未知", "您需要收集部份的年輕的女獸人和年輕的獸人旅行者來完成這個", "default", "FFRTreasures","112206"},
[39661718]={ "33532", "Cragmaul 箱子", "第一屬性精神 + 頂尖水晶", "!!! 等級100區域 !!!", "default", "FFRTreasures","120945"},
[45365034]={ "33011", "白髮的霜狼老兵", "i516 耐力飾品 + 2% 擊殺後治療", "與獸人NPC交談，戰勝一波波的獸人後，可在覆滿灰塵的箱子時取到", "default", "FFRTreasures","106899"},
--FFRRares
[88605740]={ "37525", "“屠夫”阿奧克斯", "i620 敏捷/智力 皮甲腰", "!!! 等級100 !!!", "hundredrare", "FFRHundred","823"},
[27405000]={ "34497", "無息", "玩具", "", "rare", "FFRRares","111476"},
[66403140]={ "33843", "巢母裡戈艾克", "i516 飾品 智力 + 雙擊 觸發", "", "rare", "FFRRares","111533"},
[34002320]={ "32941", "深峽冰母蜥蜴", "25 要塞資源", "", "rare", "FFRRares","101436"},
[41206820]={ "34843", "凜牙", "i513 敏捷/智力 皮甲腿", "", "rare", "FFRRares","111953"},
[40404700]={ "33014", "燼喉", "i516 法術匕首", "", "rare", "FFRRares","111490"},
[25405500]={ "34129", "哀慟者冰蹄", "i516 智力項鍊", "", "rare", "FFRRares","112066"},
[54606940]={ "34131", "寒牙", "i516 敏捷/力量 單手劍", "", "rare", "FFRRares","111484"},
[67407820]={ "34477", "颶風怒靈", "i516 布甲肩", "", "rare", "FFRRares","112086"},
[71404680]={ "33504", "炎怒巨靈", "i516 副手", "", "rare", "FFRRares","107661"},
[54602220]={ "32918", "巨人殺手庫爾", "i516 飾品 臨機應變 + 敏捷 觸發", "", "rare", "FFRRares","111530"},
[70003600]={ "37562", "熔岩鯨吸者高戈阿克", "i620 力量拳套", "!!! 等級100 !!!", "hundredrare", "FFRHundred","111545"},
[70003600]={ "37388", "Gorivax", "i620 智力 布甲護腕", "", "hundredrare", "FFRHundred","119358"},
[38606300]={ "34865", "劫掠者古圖什", "i513 敏捷/智力 鎖甲腿", "", "rare", "FFRRares","112077"},
[50305260]={ "34825", "戈魯克", "i513 飾品 加速 + 致命一擊", "", "rare", "FFRRares","111948"},
[47005520]={ "34839", "戈倫", "i513 力量 披風", "", "rare", "FFRRares","111955"},
[68801940]={ "37382", "白霜", "i620 智力精神 戒指", "!!! 等級101 !!!", "hundredrare", "FFRHundred","823"},
[58603420]={ "34130", "狩獵大師康恩", "要塞資源", "", "rare", "FFRRares","824"},
[48202340]={ "37386", "刺顎", "i620 法術盾", "!!! 等級101 !!!", "hundredrare", "FFRHundred","119390"},
[61602640]={ "34708", "『攀爬者』潔西兒", "i516 敏捷/智力 皮甲鞋", "", "rare", "FFRRares","112078"},
[43002100]={ "37387", "莫托瑪", "i620 布甲肩", "!!! 等級101 !!!", "hundredrare", "FFRHundred","119356"},
[70002700]={ "37381", "戈倫主母", "i620 力量項鍊", "!!! 等級101 !!!", "hundredrare", "FFRHundred","823"},
[83604720]={ "37402", "“絞肉機”奧戈姆", "i620 敏捷/智力 皮甲手腕", "!!! 等級100 !!!", "hundredrare", "FFRHundred","823"},
[36803400]={ "33938", "指揮官穆爾格", "i516 布甲腿", "", "rare", "FFRRares","111576"},
[86604880]={ "37401", "拉戈爾·逐流", "i620 敏捷/智力 皮甲胸", "!!! 等級100 !!!", "hundredrare", "FFRHundred","119359"},
[76406340]={ "34132", "斥候高斯克", "i516 敏捷/智力 皮甲胸", "", "rare", "FFRRares","112094"},
[45001500]={ "37385", "食屍者暴牙", "i620 敏捷/智力 皮甲頭", "!!! 等級101 !!!", "hundredrare", "FFRHundred","823"},
[38201600]={ "37383", "葛拉瑪爾之子", "i620 法術錘", "!!! 等級101 !!!", "hundredrare", "FFRHundred","119399"},
[26803160]={ "34133", "打擊者", "i516 力量 雙手錘", "", "rare", "FFRRares","111475"},
[72203300]={ "37361", "刺骨鑽行蟲", "i620 智力/力量 鎧甲胸", "!!! 等級101 !!!", "hundredrare", "FFRHundred","111534"},
[43600940]={ "37384", "托格洛斯", "i620 副手", "!!! 等級101 !!!", "hundredrare", "FFRHundred","119379"},
[40601240]={ "34522", "冰封者烏戈洛克", "i620 智力 法杖", "!!! 等級101 !!!", "hundredrare", "FFRHundred","823"},
[72402420]={ "37378", "沃卡爾", "100要塞資源", "!!! 等級101 !!!", "hundredrare", "FFRHundred","823"},
[70603900]={ "37379", "古老的沃羅克", "100要塞資源", "!!! 等級101 !!!", "hundredrare", "FFRHundred","823"},
[40402780]={ "34559", "疤臉雅佳", "i516 敏捷/智力 皮甲腰", "在較低的懸崖壁上", "rare", "FFRRares","111477"},
[84604680]={ "37403", "Earthshaker Holar", "i620 敏捷項鍊", "!!! 等級100!!!", "hundredrare", "FFRHundred","119374"},
[66602540]={ "37380", "Gibblette the Cowardly", "i620 敏捷披風 + 趣味物品", "!!! 等級101 !!! In a cave on top of a mountain, path upwards starts at 69.3, 24", "hundredrare", "FFRHundred","119349"},
[86804500]={ "37404", "Kaga the Ironbender", "i620 敏捷/智力 鎖甲腰", "!!! 等級100!!!", "hundredrare", "FFRHundred","119372"},
}
nodes["BladespireFortress"] = {
[26613949]={ "35370", "Doorogs得祕密藏匿", "金錢 + 垃圾物品", "劍刃堡壘的第二層, 外邊", "default", "FFRBF","113189"},
[26403642]={ "35367", "Gorr'thogg的個人儲藏", "酒精飲料", "劍刃堡壘的最上層, 王座的旁邊", "default", "FFRBF","118108"},
[26603520]={ "35347", "巨魔的戰利品", "要塞資源", "劍刃堡壘的第二層", "default", "FFRBF","824"},
[28293440]={ "35368", "巨魔的戰利品", "金錢", "劍刃堡壘的第一層; 需要爬上一些木箱才能到達", "default", "FFRBF",""},
[27783917]={ "35369", "巨魔的戰利品", "金錢", "劍刃堡壘的第一層; 需要爬上一些木箱才能到達", "default", "FFRBF",""},
[27603382]={ "35371", "巨魔的戰利品", "金錢", "劍刃堡壘的第二層; 需要爬上一些木箱才能到達", "default", "FFRBF",""},
[27173763]={ "35373", "巨魔的戰利品", "金錢", "劍刃堡壘的第二層; 需要爬上一些木箱才能到達", "default", "FFRBF",""},
[28093409]={ "35567", "巨魔的戰利品", "要塞資源", "劍刃堡壘的第二層", "default", "FFRBF","824"},
[30723869]={ "35568", "巨魔的戰利品", "要塞資源", "劍刃堡壘的第二層", "default", "FFRBF","824"},
[30083927]={ "35569", "巨魔的戰利品", "要塞資源", "劍刃堡壘的第二層", "default", "FFRBF","824"},
[27283876]={ "35570", "巨魔的戰利品", "金錢", "劍刃堡壘的第一層", "default", "FFRBF",""},
}
nodes["Gorgrond"] = {
--GorgrondTreasures
[41705300]={ "36506", "波爾卡的袋子", "i538 法術法杖", "", "default", "GorgrondTreasures","118702"},
[42408340]={ "36625", "被遺棄的包裹", "金錢 + 隨機裝綁綠裝", "", "default", "GorgrondTreasures",""},
[41807810]={ "36658", "永晨補給籃", "隨機裝綁綠裝", "", "default", "GorgrondTreasures",""},
[40407660]={ "36621", "探險家罐子", "50 要塞資源", "", "default", "GorgrondTreasures","118710"},
[40007230]={ "36170", "稀有腿骨", "垃圾物品", "", "default", "GorgrondTreasures","118715"},
[46105000]={ "36651", "可收穫的珍貴水晶", "要塞資源", "", "default", "GorgrondTreasures","824"},
[42604680]={ "35056", "長角的顱骨", "要塞資源", "", "default", "GorgrondTreasures","824"},
[43704240]={ "36618", "鋼鐵補給箱", "要塞資源", "", "default", "GorgrondTreasures","824"},
[44207420]={ "35709", "嘲顱包裹", "要塞資源", "在樹上", "default", "GorgrondTreasures","824"},
[43109290]={ "34241", "奧卡巴的包裹", "垃圾物品", "", "default", "GorgrondTreasures","118227"},
[52506690]={ "36509", "奇怪的顱骨", "i535 副手", "", "default", "GorgrondTreasures","118717"},
[46204290]={ "36521", "石化的雙頭飛龍蛋", "垃圾物品", "", "default", "GorgrondTreasures","118707"},
[43957055]={ "36118", "一堆瓦礫", "隨機裝綁綠裝", "", "default", "GorgrondTreasures",""},
[53107440]={ "36654", "巴裡克·碎礦的遺骸", "垃圾物品", "", "default", "GorgrondTreasures","118714"},
[57805600]={ "36605", "波迪爾·深岩的遺物", "垃圾物品", "", "default", "GorgrondTreasures","118703"},
[39006810]={ "36631", "薩莎的秘密包裹", "金錢 + 隨機裝綁綠裝", "", "default", "GorgrondTreasures",""},
[45004260]={ "36634", "狙擊手的強弩", "i539 弩", "", "default", "GorgrondTreasures","118713"},
[48109340]={ "36604", "隱秘的急救背包", "金錢 + 隨機裝綁綠裝", "", "default", "GorgrondTreasures",""},
[53008000]={ "34940", "樣子古怪的匕首", "i537 敏捷匕首", "", "default", "GorgrondTreasures","118718"},
[57066529]={ "37249", "奇怪的孢子  ", "寵物", "黏附在峭壁外面的蘑菇頂部", "default", "GorgrondTreasures","118106"},
[45704970]={ "36610", "日灼之矛", "垃圾物品", "", "default", "GorgrondTreasures","118708"},
[59406370]={ "36628", "守備官的戰錘", "i539 力量 雙手錘", "", "default", "GorgrondTreasures","118712"},
[48904730]={ "36203", "熱乎乎的鬣蜥人蛋", "7天后會孵出玩具的蛋", "", "default", "GorgrondTreasures","118705"},
[49304360]={ "36596", "武器架", "100 要塞資源", "", "default", "GorgrondTreasures","107645"},
--GorgrondRares
[58604120]={ "37371", "艾卡利", "i620 敏捷/智力 皮甲手套", "!!! 等級100 !!!", "hundredrare", "GorgrondHundred","823"},
[40007900]={ "35335", "巴希歐克", "玩具", "", "rare", "GorgrondRares","118222"},
[69204460]={ "37369", "林地保護者", "玩具", "!!! 等級100 !!! 3個都在一起", "hundredrare", "GorgrondHundred","119432"},
[39407460]={ "36597", "Berthora", "i532 敏捷/智力 鎖甲肩", "", "rare", "GorgrondRares","118232"},
[46003360]={ "37368", "大劍師羅格爾", "i620 布甲鞋", "!!! 等級101 !!!", "hundredrare", "GorgrondHundred",""},
[53404460]={ "35503", "焦焰古樹", "i536 雙手 法術錘", "", "rare", "GorgrondRares","118212"},
[48202100]={ "37362", "背叛者達茲格", "i620 力量長柄", "!!! 等級101 !!!", "hundredrare", "GorgrondHundred",""},
[57603580]={ "37370", "深根", "i620 敏捷長柄", "!!! 等級100 !!! 兩個出生點其中之一", "hundredrare", "GorgrondHundred","119406"},
[72604040]={ "37370", "深根", "i620 敏捷長柄", "!!! 等級100 !!! 兩個出生點其中之一", "hundredrare", "GorgrondHundred","119406"},
[50002380]={ "37366", "被憎恨的德普", "i620 敏捷 皮甲腰", "!!! 等級101 !!!", "hundredrare", "GorgrondHundred",""},
[72803580]={ "37373", "縱火者格拉許", "i620 敏捷 皮甲腰", "!!! 等級100 !!! 兩個出生點其中之一", "hundredrare", "GorgrondHundred",""},
[58003640]={ "37373", "縱火者格拉許", "i620 敏捷 皮甲腰", "!!! 等級100 !!! 兩個出生點其中之一", "hundredrare", "GorgrondHundred",""},
[57406860]={ "36387", "石化的岩木", "玩具", "", "rare", "GorgrondRares","118221"},
[41804540]={ "36391", "“藍焰”戈爾高", "i534 飾品 臨機應變 + 智力 觸發", "", "rare", "GorgrondRares","118230"},
[46205080]={ "36204", "格魯特", "i534 飾品 敏捷 + 雙擊 觸發", "", "rare", "GorgrondRares","118229"},
[52805360]={ "37413", "瘤顎", "i620 智力拳套 附加法術觸發", "!!! 等級100 !!!", "hundredrare", "GorgrondHundred","119397"},
[46804320]={ "36186", "戈爾多克 the Cunning", "i534 力量 單手錘", "", "rare", "GorgrondRares","118210"},
[59604300]={ "37375", "林地守衛雅爾", "i620 智力 披風", "!!! 等級100 !!!", "hundredrare", "GorgrondHundred","119414"},
[52207020]={ "35908", "蟲巢女王斯基卡", "i534 法強斧", "", "rare", "GorgrondRares","118209"},
[47002380]={ "37365", "霍爾格", "i620 敏捷/智力 鎖甲胸", "!!! 等級100 !!!", "hundredrare", "GorgrondHundred","119229"},
[55004660]={ "37377", "獵人芭爾菈", "i620 弓", "!!! 等級100 !!!", "hundredrare", "GorgrondHundred","119412"},
[47603060]={ "37367", "發明者布蘭茉", "i620 敏捷槍 + 趣味物品", "!!! 等級101 !!!", "hundredrare", "GorgrondHundred",""},
[52205580]={ "37412", "史萊姆王", "i620 力量披風", "!!! 等級100 !!!", "hundredrare", "GorgrondHundred","119351"},
[50605320]={ "36178", "曼達科爾", "寵物", "", "rare", "GorgrondRares","118709"},
[49003380]={ "37363", "瘋狂的馬德加爾", "i620 智力項鍊", "!!! 等級101 !!!", "hundredrare", "GorgrondHundred",""},
[61803930]={ "37376", "莫加馬格", "i620 力量盾", "!!! 等級100 !!!", "hundredrare", "GorgrondHundred","119391"},
[47002580]={ "37364", "莫戈肯恩", "i620 力量/智力 鎧甲頭", "!!! 等級100 !!!", "hundredrare", "GorgrondHundred",""},
[53407820]={ "34726", "蛛後阿蘭妮艾", "i534 敏捷匕首", "", "rare", "GorgrondRares","118208"},
[37608140]={ "36600", "裡普塔爾", "i539 法術匕首", "", "rare", "GorgrondRares","118231"},
[47804140]={ "36393", "洛克爾", "i539 飾品 力量 + 致命一擊 觸發", "", "rare", "GorgrondRares","118211"},
[54207240]={ "36837", "怒蹄", "i537 雙手 敏捷/力量錘", "", "rare", "GorgrondRares","118228"},
[38206620]={ "35910", "踐踏者克羅格", "食人魔釀造工具組", "每7天可以產出酒精飲料", "rare", "GorgrondRares","118224"},
[40205960]={ "36394", "硫磺之怒", "玩具", "", "rare", "GorgrondRares","114227"},
[44609220]={ "36656", "日爪", "i533 敏捷拳套", "", "rare", "GorgrondRares","118223"},
[59903200]={ "37374", "迅捷的黑瑪瑙撕掠者", "i620 敏捷/智力 鎖甲鞋", "!!! 等級100 !!!", "hundredrare", "GorgrondHundred","119367"},
[64006180]={ "36794", "塞爾多斯", "i540 敏捷/智力 皮甲鞋", "", "rare", "GorgrondRares","118213"},
[76004200]={ "37405", "提豐", "頂尖水晶", "!!! 等級100 !!!", "rare", "GorgrondRares","823"},
[63803160]={ "37372", "維諾拉希斯", "i620 敏捷匕首", "!!! 等級100 !!!", "hundredrare", "GorgrondHundred",""},
}
nodes["Talador"] = {
--TaladorTreasures
[36509610]={ "34182", "阿爾克的傳家寶", "i557 弩", "", "default", "TaladorTreasures","117567"},
[62083238]={ "34236", "艾米瑟爾水晶", "100 要塞資源", "", "default", "TaladorTreasures","116131"},
[81843494]={ "34260", "阿魯納礦車", "礦物", "", "default", "TaladorTreasures","109118"},
[62414797]={ "34252", "一桶魚", "魚", "", "default", "TaladorTreasures","110506"},
[33297680]={ "34259", "噬骨遺物", "要塞資源", "", "default", "TaladorTreasures","824"},
[37607490]={ "34148", "噬骨長矛", "i566 敏捷/智力 鎖甲手套", "長矛從Viperlash的屍體產生", "default", "TaladorTreasures","112371"},
[73525137]={ "34471", "閃亮硬幣", "i560 飾品 臨機應變 + 護甲加成觸發", "", "default", "TaladorTreasures","116127"},
[70100700]={ "36937", "燃刃寶箱", "頂尖水晶", "", "default", "TaladorTreasures","823"},
[77044996]={ "34248", "燒焦的長劍", "i563 雙手 力量劍", "", "default", "TaladorTreasures","116116"},
[66508694]={ "34239", "古怪的逝網蛛卵", "玩具", "", "default", "TaladorTreasures","117569"},
[58901200]={ "33933", "德塞普提亞的冒煙靴子", "玩具", "", "default", "TaladorTreasures","108743"},
[55256671]={ "34253", "德萊尼武器", "100 要塞資源", "", "default", "TaladorTreasures","116118"},
[35419656]={ "34249", "農夫的寶貝", "要塞資源", "", "default", "TaladorTreasures","824"},
[57362866]={ "34238", "工頭的午餐盒", "重複性 食物/飲料", "", "default", "TaladorTreasures","116120"},
[64587920]={ "34251", "鐵盒子", "i554 單手 力量錘", "", "default", "TaladorTreasures","117571"},
[75003600]={ "33649", "鋼鐵斥候", "未知", "", "default", "TaladorTreasures",""},
[57207540]={ "34134", "Isaari的寶箱", "i564 敏捷項鍊", "", "default", "TaladorTreasures","117563"},
[65471137]={ "34233", "一大壺陳年黑鐵佳釀", "酒精飲料", "", "default", "TaladorTreasures","117568"},
[75684140]={ "34261", "克魯的物品  ", "金錢", "", "default", "TaladorTreasures",""},
[53972769]={ "34290", "凱特婭的寶箱", "寵物", "", "default", "TaladorTreasures","116402"},
[38191242]={ "34258", "海洋之光", "要塞資源", "", "default", "TaladorTreasures","824"},
[68805620]={ "34101", "聖光使者", "垃圾物品", "", "default", "TaladorTreasures","109192"},
[52562954]={ "34235", "微光貝殼", "i557 智力項鍊", "", "default", "TaladorTreasures","116132"},
[78211471]={ "34263", "純淨水晶塵", "i554 敏捷 戒指", "", "default", "TaladorTreasures","117572"},
[75784472]={ "34250", "阿魯納遺物", "垃圾物品", "", "default", "TaladorTreasures","116128"},
[46969174]={ "34256", "泰爾莫遺物", "垃圾物品", "", "default", "TaladorTreasures","116128"},
[64901330]={ "34232", "魯克的工具盒", "+4 釣魚線", "", "default", "TaladorTreasures","116117"},
[65968513]={ "34276", "生鏽寶箱", "隨機裝綁綠裝", "", "default", "TaladorTreasures",""},
[39505520]={ "34254", "縛魂者的聖物箱", "i558 智力 戒指", "", "default", "TaladorTreasures","117570"},
[74602930]={ "35162", "恐爪鳥巢穴 1", "寵物", "只有一個恐爪鳥巢可以拾取", "default", "TaladorTreasures","112699"},
[39307770]={ "35162", "恐爪鳥巢穴 10", "寵物", "只有一個恐爪鳥巢可以拾取", "default", "TaladorTreasures","112699"},
[73503070]={ "35162", "恐爪鳥巢穴 2", "寵物", "只有一個恐爪鳥巢可以拾取", "default", "TaladorTreasures","112699"},
[74303400]={ "35162", "恐爪鳥巢穴 3", "寵物", "只有一個恐爪鳥巢可以拾取", "default", "TaladorTreasures","112699"},
[72803560]={ "35162", "恐爪鳥巢穴 4", "寵物", "只有一個恐爪鳥巢可以拾取", "default", "TaladorTreasures","112699"},
[72403700]={ "35162", "恐爪鳥巢穴 5", "寵物", "只有一個恐爪鳥巢可以拾取", "default", "TaladorTreasures","112699"},
[70903550]={ "35162", "恐爪鳥巢穴 6", "寵物", "只有一個恐爪鳥巢可以拾取", "default", "TaladorTreasures","112699"},
[70803200]={ "35162", "恐爪鳥巢穴 7", "寵物", "只有一個恐爪鳥巢可以拾取", "default", "TaladorTreasures","112699"},
[54105630]={ "35162", "恐爪鳥巢穴 8", "寵物", "只有一個恐爪鳥巢可以拾取", "default", "TaladorTreasures","112699"},
[39807670]={ "35162", "恐爪鳥巢穴 9", "寵物", "只有一個恐爪鳥巢可以拾取", "default", "TaladorTreasures","112699"},
[38408450]={ "34257", "安葛洛什寶藏", "趣味物品 - 投擲的岩石", "", "default", "TaladorTreasures","116119"},
[65508860]={ "34255", "結網的囊袋", "金錢", "", "default", "TaladorTreasures",""},
[40608950]={ "34140", "尤裡的禮物", "要塞資源", "", "default", "TaladorTreasures","824"},
[28397419]={ "36829", "Gift of the Ancients", "i563 智力戒指", "在洞穴內; 轉動所有三個雕像，讓他們不要面對中央空白的部分，就會出現寶箱", "default", "TaladorTreasures","118686"},
[39304172]={ "34207", "Sparkling Pool", "要塞資源 + 釣魚用品", "需要釣魚", "default", "TaladorTreasures","112623"},
--TaladorRares
[46603520]={ "37338", "索奎薩爾的化身", "i620 副手", "!!! 等級101 !!!", "hundredrare", "TaladorHundred","119378"},
[44003800]={ "37339", "投彈手古戈克", "i620 弩", "!!! 等級101 !!!", "hundredrare", "TaladorHundred","119413"},
[37607040]={ "34165", "考爾·裂肉者", "i558 力量 單手錘", "", "rare", "TaladorRares","116123"},
[68201580]={ "34142", "格魯姆博士", "趣味物品 - 臭氣彈", "", "rare", "TaladorRares","112499"},
[34205700]={ "34221", "摩摩爾的回響", "玩具", "", "rare", "TaladorRares","113670"},
[50808380]={ "35018", "邪皮", "i554 法術盾", "", "rare", "TaladorRares","112373"},
[50203520]={ "37341", "魔焰之后", "i620 敏捷 戒指", "!!! 等級101 !!!", "hundredrare", "TaladorHundred","119386"},
[46005500]={ "34145", "瘋狂的魔像", "i563 敏捷/力量 單手劍 或 i563 法術匕首", "", "rare", "TaladorRares","113287"},
[67408060]={ "34929", "加納迪安", "i558 飾品 敏捷 +精通 觸發", "", "rare", "TaladorRares","116075"},
[31806380]={ "34189", "閃翼", "有使用次數限制的短期加速增益", "", "rare", "TaladorRares","116113"},
[22207400]={ "36919", "格布戈爾", "無掉落", "不安分的木箱; 任務不會被標記為已完成，大概又bug了", "rare", "TaladorRares",""},
[47603900]={ "37340", "古格托爾", "i620 法術劍", "!!! 等級101 !!!", "hundredrare", "TaladorHundred","119402"},
[48002500]={ "37312", "『盡噬者』赫昆", "i620 力量 單手劍", "!!! 等級100 !!!", "hundredrare", "TaladorHundred","119403"},
[62004600]={ "34185", "槌牙", "i558 敏捷/智力 鎖甲胸", "", "rare", "TaladorRares","116124"},
[78005040]={ "34167", "雌鳥哈米", "i556 智力 披風", "", "rare", "TaladorRares","112369"},
[56606360]={ "35219", "自負的卡拉佐斯/戈爾佐瑪/Sikthiss", "玩具", "其中之一-只能拾取一次", "rare", "TaladorRares","116122"},
[66808540]={ "34498", "克裡奇克斯", "玩具", "", "rare", "TaladorRares","116125"},
[37203760]={ "37348", "庫爾洛什·滅牙", "i620 敏捷匕首", "!!! 等級102 !!!", "hundredrare", "TaladorHundred","823"},
[33803780]={ "37346", "丹萊許女士", "i620 布甲胸", "!!! 等級102 !!!", "hundredrare", "TaladorHundred","823"},
[37802140]={ "37342", "軍團先鋒", "i620 力量/智力 鎧甲手腕", "!!! 等級101 !!!", "hundredrare", "TaladorHundred","823"},
[49009200]={ "34208", "洛瑪格·碎顎", "i558 力量項鍊", "", "rare", "TaladorRares","116070"},
[30502640]={ "37345", "領主寇里納克", "i620 力量 戒指", "!!! 等級102 !!!", "hundredrare", "TaladorHundred","119388"},
[39004960]={ "37349", "罪惡女族長", "i620 布甲手套", "!!! 等級102 !!!", "hundredrare", "TaladorHundred","119353"},
[86403040]={ "34859", "諾洛什", "i558 飾品 臨機應變 + 智力 觸發", "", "rare", "TaladorRares","116077"},
[31404750]={ "37344", "『觀察者』歐魯姆", "i620 智力項鍊 + 寵物", "!!! 等級102 !!! 需要5位玩家同時站在符文中才能召喚", "hundredrare", "TaladorHundred","823"},
[59505960]={ "34196", "拉坎", "i563 敏捷拳套", "", "rare", "TaladorRares","116112"},
[41004200]={ "37347", "暗焰懼行者", "i620 力量單手斧", "!!! 等級102 !!!", "hundredrare", "TaladorHundred","823"},
[41805940]={ "34671", "沙茲爾", "i554 敏捷/智力 皮甲鞋", "", "rare", "TaladorRares","112370"},
[67703550]={ "36858", "鋼牙", "i559 敏捷長柄", "", "rare", "TaladorRares","117562"},
[46002740]={ "37337", "薩格萊戰事議會", "i620 智力披風", "!!! 等級101 !!! 三個都在一起", "hundredrare", "TaladorHundred","823"},
[59008800]={ "34171", "塔拉多寡婦蛛", "i565 敏捷劍", "", "rare", "TaladorRares","116126"},
[53909100]={ "34668", "鴉爪祭司佐卡拉", "i560 布甲頭盔", "", "rare", "TaladorRares","116110"},
[63802070]={ "34945", "低階監工血鬃", "i554 力量 戒指", "別殺死他的寵物", "rare", "TaladorRares","112475"},
[36804100]={ "37350", "警戒的帕索斯", "i620 智力/力量 鎧甲肩", "!!! 等級102 !!!", "hundredrare", "TaladorHundred","119383"},
[69603340]={ "34205", "遊蕩的守備官", "i554 力量 單手劍", "", "rare", "TaladorRares","112261"},
[38001460]={ "37343", "『毀滅者』索薩亞", "i620 敏捷/智力 鎖甲肩", "!!! 等級100 !!!", "hundredrare", "TaladorHundred","119371"},
[53802580]={ "34135", "焚化者亞茲拉", "i554 敏捷/智力 鎖甲手腕", "", "rare", "TaladorRares","112263"},
}
nodes["SpiresOfArak"] = {
--SoATreasures
[40595497]={ "36458", "被遺棄的採礦鋤", "i578 力量 單手斧", "在德拉諾允許更加快速的採礦", "default", "SoATreasures","116913"},
[36195446]={ "36462", "泰勒上將的保險箱", "要塞資源", "需要一把舊鑰匙", "default", "SoATreasures","824"},
[37705640]={ "36462", "舊鑰匙", "泰勒上將要塞一個寶箱的鑰匙", "", "default", "SoATreasures","116020"},
[49203721]={ "36445", "刺客的長矛", "i580 敏捷長柄", "", "default", "SoATreasures","116835"},
[55539086]={ "36366", "戰爭捐贈物資", "金錢", "", "default", "SoATreasures",""},
[68428898]={ "36453", "折幣的報酬", "要塞資源", "", "default", "SoATreasures","824"},
[36585791]={ "36418", "厄菲阿爾的黑暗魔典", "i579 副手", "", "default", "SoATreasures","116914"},
[50502210]={ "36246", "龜裂的太陽石", "垃圾物品", "", "default", "SoATreasures","116919"},
[37154750]={ "36420", "要塞補給品", "要塞資源", "", "default", "SoATreasures","824"},
[41855042]={ "36451", "要塞工匠的錘子", "i580 力量 單手錘", "", "default", "SoATreasures","116918"},
[48604450]={ "36386", "安祖之賜", "i585 弩", "飲用一個暗影視界藥劑 靠近聖壇以獲取安祖之賜", "default", "SoATreasures","118237"},
[57007900]={ "36390", "安祖之賜", "i585 法術 單手劍", "飲用一個暗影視界藥劑 靠近聖壇以獲取安祖之賜", "default", "SoATreasures","118241"},
[46954044]={ "36389", "安祖之賜", "i585 敏捷/力量長柄", "飲用一個暗影視界藥劑 靠近聖壇以獲取安祖之賜", "default", "SoATreasures","118238"},
[52031958]={ "36392", "安祖之賜", "i585 法術法杖", "飲用一個暗影視界藥劑 靠近聖壇以獲取安祖之賜", "default", "SoATreasures","118239"},
[42402670]={ "36388", "安祖之賜", "i585 魔杖", "飲用一個暗影視界藥劑 靠近聖壇以獲取安祖之賜", "default", "SoATreasures","118242"},
[61105537]={ "36381", "安祖之賜", "i585 敏捷/力量 單手劍", "飲用一個暗影視界藥劑 靠近聖壇以獲取安祖之賜", "default", "SoATreasures","118240"},
[50332579]={ "36444", "鋼鐵部落炸藥", "垃圾物品", "", "default", "SoATreasures","118691"},
[50782874]={ "36247", "失落的草藥袋", "草藥", "", "default", "SoATreasures","109124"},
[47773612]={ "36411", "失落的戒指", "i578 智力 戒指", "", "default", "SoATreasures","116911"},
[52474280]={ "36416", "遺失的卷軸", "考古碎片", "要求考古學和可能一點跳躍", "default", "SoAArchaeology",""},
[42691832]={ "36244", "遺失的卷軸", "考古碎片", "要求考古學和可能一點跳躍", "default", "SoAArchaeology",""},
[63586737]={ "36454", "神秘菌菇", "變色龍蓮花", "", "default", "SoATreasures","109130"},
[60808780]={ "35481", "Nizzix的寶箱", "要塞資源", "點擊Nizzix在 60.9 88.0 的逃生艙並跟隨他到岸邊", "default", "SoATreasures","824"},
[53315552]={ "36403", "鴉母的供品 1", "獎勵5%休息經驗值的消耗品", "", "default", "SoATreasures","118267"},
[48355261]={ "36405", "鴉母的供品 2", "獎勵5%休息經驗值的消耗品", "", "default", "SoATreasures","118267"},
[48905470]={ "36406", "鴉母的供品 3", "獎勵5%休息經驗值的消耗品", "", "default", "SoATreasures","118267"},
[51886465]={ "36407", "鴉母的供品 4", "獎勵5%休息經驗值的消耗品", "", "default", "SoATreasures","118267"},
[60976387]={ "36410", "鴉母的供品 5", "獎勵5%休息經驗值的消耗品", "", "default", "SoATreasures","118267"},
[58706024]={ "36340", "獨眼魔戰利品", "垃圾物品", "", "default", "SoATreasures","116921"},
[36283934]={ "36402", "獸人信號號角", "i577 飾品 雙擊 + 力量 觸發", "", "default", "SoATreasures","120337"},
[36821716]={ "36243", "流亡者財物 1", "金錢 + 隨機裝綁綠裝", "", "default", "SoATreasures",""},
[42172168]={ "36447", "流亡者財物 2", "金錢 + 隨機裝綁綠裝", "", "default", "SoATreasures",""},
[46903406]={ "36446", "流亡者袋子", "金錢 + 隨機裝綁綠裝", "", "default", "SoATreasures",""},
[42961637]={ "36245", "流亡者聖物 1", "考古碎片", "要求考古學和可能一點跳躍", "default", "SoAArchaeology",""},
[45964415]={ "36354", "流亡者聖物 2", "考古碎片", "要求考古學和可能一點跳躍", "default", "SoAArchaeology",""},
[43162726]={ "36355", "流亡者聖物 3", "考古碎片", "要求考古學和可能一點跳躍", "default", "SoAArchaeology",""},
[67373983]={ "36356", "流亡者聖物 4", "考古碎片", "要求考古學和可能一點跳躍", "default", "SoAArchaeology",""},
[60215391]={ "36359", "流亡者聖物 5", "考古碎片", "要求考古學和可能一點跳躍", "default", "SoAArchaeology",""},
[51894892]={ "36360", "流亡者聖物 6", "考古碎片", "要求考古學和可能一點跳躍", "default", "SoAArchaeology",""},
[37375056]={ "36657", "魯比的洛洛", "i581 力量項鍊", "你需要在地窖中從廚師拿到Rooby Reat來喂狗", "default", "SoATreasures","116887"},
[44331204]={ "36377", "魯克瑪的影像", "垃圾物品", "", "default", "SoATreasures","118693"},
[59179064]={ "36366", "水手扎祖克的高純度朗姆酒  ", "酒精飲料", "", "default", "SoATreasures","116917"},
[68333893]={ "36375", "塞泰克神像", "垃圾物品", "", "default", "SoATreasures","118692"},
[71644859]={ "36450", "塞泰克儀式用酒", "治療藥水 + 酒精飲料", "", "default", "SoATreasures","109223"},
[56232881]={ "36362", "碎手寶箱", "要塞資源", "", "default", "SoATreasures","824"},
[47923065]={ "36361", "碎手保險箱", "真鐵上鎖箱", "", "default", "SoATreasures","116920"},
[60868461]={ "36456", "切割機零件", "要塞資源", "", "default", "SoATreasures","824"},
[56294531]={ "36433", "走私的頂尖遺物", "考古碎片", "要求考古學和可能一點跳躍", "default", "SoAArchaeology",""},
[59638134]={ "36365", "自動噴灑機5000XT型", "要塞資源", "", "default", "SoATreasures","824"},
[34142751]={ "36421", "烈日寶箱 1", "要塞資源", "", "default", "SoATreasures","824"},
[33292727]={ "36422", "烈日寶箱 2", "考古碎片", "要求考古學和可能一點跳躍", "default", "SoAArchaeology",""},
[54353255]={ "36364", "毒牙毒液", "100 要塞資源", "", "default", "SoATreasures","118695"},
[66475653]={ "36455", "浸水的背包", "金錢 + 隨機裝綁綠裝", "", "default", "SoATreasures",""},
[57802220]={ "36374", "Statue of Anzu", "垃圾物品", "", "default", "SoATreasures","118694"},
--SoARares
[58208460]={ "36291", "貝蒂斯·爆籃", "i583 槍", "", "rare", "SoARares","116907"},
[46802300]={ "35599", "劍舞者艾瑞克斯", "垃圾物品", "", "rare", "SoARares","116839"},
[64006480]={ "36283", "凋零之光", "i586 敏捷/智力 皮甲肩", "", "rare", "SoARares","118205"},
[46402860]={ "36267", "杜卡斯·鋼喉", "i586 敏捷/智力 鎖甲鞋", "", "rare", "SoARares","118198"},
[69005400]={ "37406", "艾奇迪納", "未知", "!!! 等級100 !!!", "hundredrare", "SoAHundred",""},
[54803960]={ "36297", "膿花", "i584 副手", "", "rare", "SoARares","118200"},
[25202420]={ "36943", "加茲", "要塞資源", "", "rare", "SoARares","824"},
[74404280]={ "37390", "暴食巨人", "i620 魔杖", "!!! 等級100 !!!", "hundredrare", "SoAHundred","823"},
[33005900]={ "36305", "貪鰭", "垃圾物品", "", "rare", "SoARares","116836"},
[59201500]={ "36887", "獨居的白鬃", "i582 布甲頭盔", "", "rare", "SoARares","118279"},
[56609460]={ "36306", "孢子吞噬者賈斯卡", "i589 飾品 加速 + 智力 觸發", "", "rare", "SoARares","118202"},
[62603740]={ "36268", "浴血的卡洛斯", "i588 布甲胸", "", "rare", "SoARares","118735"},
[53208900]={ "36396", "穆塔芬", "i589 力量 雙手錘", "", "rare", "SoARares","118206"},
[36405240]={ "36129", "納斯·杜柏林", "i578 敏捷/力量長柄", "", "rare", "SoARares","116837"},
[66005500]={ "36288", "復仇者奧斯奇拉", "i589 敏捷匕首", "", "rare", "SoARares","118204"},
[59403740]={ "36279", "毒藥大師波塔斯克", "i583 飾品 雙擊 + DMG 使用後", "", "rare", "SoARares","118199"},
[38402780]={ "36470", "爛菌", "寵物", "", "rare", "SoARares","118107"},
[69004880]={ "36276", "桑裡卡斯", "i589 敏捷/智力 皮甲胸", "", "rare", "SoARares","118203"},
[71203380]={ "37392", "暗影巨人", "i620 敏捷/智力 皮甲腿", "!!! 等級100 !!!", "hundredrare", "SoAHundred","823"},
[52003540]={ "36478", "影皮", "i579 法術盾", "", "rare", "SoARares","118201"},
[51800720]={ "37394", "日光放大器", "i620 智力長柄", "!!! 等級100 !!!", "hundredrare", "SoAHundred",""},
[33402200]={ "36265", "岩怒", "i577 敏捷/智力 鎖甲腿", "", "rare", "SoARares","116858"},
[58604520]={ "36298", "碎棘", "i578 敏捷 單手劍", "", "rare", "SoARares","116855"},
[52805480]={ "36472", "沼葉", "i582 法術法杖", "", "rare", "SoARares","116857"},
[54606320]={ "36278", "斷爪者", "i578 敏捷項鍊", "", "rare", "SoARares","116838"},
[57407400]={ "36254", "破碎者特斯卡", "i578 智力項鍊", "", "rare", "SoARares","116852"},
[71702010]={ "37360", "Formless Nightmare", "i620 敏捷/智力 Mail Bracer", "!!! 等級100!!! Located inside Void Portal phase", "hundredrare", "SoAHundred","119373"},
[71404500]={ "37393", "Giga Sentinel", "i620 敏捷 單手劍", "!!! 等級100!!!", "hundredrare", "SoAHundred","119401"},
[70402380]={ "37361", "Kenos the Unraveler", "i620 布甲頭", "!!! 等級100!!! Located inside Void Portal phase; requires 3 players to click objects to summon", "hundredrare", "SoAHundred","119354"},
[74413864]={ "37391", "Mecha Plunderer", "i620 敏捷 單手錘", "!!! 等級100!!!", "hundredrare", "SoAHundred","119398"},
[72401940]={ "37358", "Soul-Twister Torek", "玩具 + i620 法術法杖", "!!! 等級100!!!", "hundredrare", "SoAHundred","119410"},
[72903090]={ "37359", "Voidreaver Urnae", "i620 敏捷 單手斧", "!!! 等級100!!!", "hundredrare", "SoAHundred","119392"},
}
nodes["NagrandDraenor"] = {
--NagrandTreasures
[73071080]={ "35951", "一堆泥土", "要塞資源", "", "default", "NagrandTreasures","824"},
[67655971]={ "35759", "被遺棄的貨箱", "金錢", "", "default", "NagrandTreasures",""},
[38404940]={ "36711", "阿布加爾最愛的魚餌", "阿布加爾最愛的魚餌", "結合阿布加爾的其他物品以獲得追隨", "default", "NagrandTreasures","114245"},
[85403870]={ "36711", "阿布加爾丟失的線輪", "阿布加爾最好的線輪", "結合阿布加爾的其他物品以獲得追隨", "default", "NagrandTreasures","114243"},
[65906120]={ "36711", "阿布加爾的活力", "阿布加爾的活力", "結合阿布加爾的其他物品以獲得追隨", "default", "NagrandTreasures","114242"},
[75816203]={ "36077", "冒險者的釘錘", "金錢", "", "default", "NagrandTreasures",""},
[82275660]={ "35765", "冒險者的包裹", "金錢", "", "default", "NagrandTreasures",""},
[45635200]={ "35969", "冒險者的包裹", "金錢", "", "default", "NagrandTreasures",""},
[69955244]={ "35597", "冒險者的包裹", "金錢", "", "default", "NagrandTreasures",""},
[56567294]={ "36050", "冒險者的錢袋", "要塞資源", "", "default", "NagrandTreasures","824"},
[73931405]={ "35955", "冒險者的袋子", "金錢", "", "default", "NagrandTreasures",""},
[81461307]={ "35953", "冒險者的法杖", "金錢", "", "default", "NagrandTreasures",""},
[73057554]={ "35673", "偷來的戰歌補給品", "要塞資源", "", "default", "NagrandTreasures","824"},
[62546708]={ "36116", "一袋草藥", "草藥", "", "default", "NagrandTreasures","109124"},
[77312807]={ "35986", "骨質匕首", "i597 敏捷匕首", "", "default", "NagrandTreasures","116760"},
[77081662]={ "36174", "元素的寶藏", "要塞資源", "使用元素石來取得", "default", "NagrandTreasures","824"},
[81083725]={ "35661", "閃亮的夢境花瓣", "回魔藥水", "乘探險家倫佐的滑翔翼到那裡  [這裡的東北方]", "default", "NagrandTreasures","118262"},
[85415347]={ "35696", "燃刃寶箱", "隨機裝綁綠裝", "", "default", "NagrandTreasures","824"},
[66961949]={ "35954", "元素祭品", "垃圾物品", "", "default", "NagrandTreasures","118234"},
[78901556]={ "36036", "元素鐐銬", "i605 敏捷 戒指", "", "default", "NagrandTreasures","118251"},
[53407320]={ "900003", "探險家比斯伯", "沒什麼 - 需要 2 財寶 在南邊", "您需要使用火箭到他那邊 [他位置的東南方]", "glider", "NagrandTreasures",""},
[67601420]={ "900004", "探險家德茲", "沒什麼", "你能聯繫到他在元素高原東邊開始的地方", "glider", "NagrandTreasures",""},
[87204100]={ "900005", "探險家加裡克斯", "沒什麼", "需要 2 財寶 [1 南方, 1 東南]", "glider", "NagrandTreasures",""},
[75606460]={ "900006", "探險家拉祖克", "沒什麼", "需要 3 財寶 [1 北, 1 東, 1 南]", "glider", "NagrandTreasures",""},
[83803380]={ "900007", "探險家倫佐", "沒什麼", "需要 3 財寶 [2 東北, 1 西南]", "glider", "NagrandTreasures",""},
[45866629]={ "36020", "沃舒古碎片", "i607 智力盾", "", "default", "NagrandTreasures","117981"},
[73052153]={ "35692", "淡水蛤蜊", "垃圾物品", "", "default", "NagrandTreasures","118233"},
[88901824]={ "35660", "長滿真菌的寶箱", "要塞資源", "乘探險家倫佐的滑翔翼到那裡 [這裡的西南方]", "default", "NagrandTreasures","824"},
[75374711]={ "36074", "賭徒的錢袋", "趣味物品", "", "default", "NagrandTreasures","118236"},
[43225755]={ "35987", "吉尼達爾殘骸", "要塞資源", "", "default", "NagrandTreasures","824"},
[48066011]={ "35999", "吉尼達爾殘骸", "要塞資源", "", "default", "NagrandTreasures","824"},
[48587279]={ "36008", "吉尼達爾殘骸", "要塞資源", "", "default", "NagrandTreasures","824"},
[44696757]={ "36002", "吉尼達爾殘骸", "要塞資源", "", "default", "NagrandTreasures","824"},
[55356828]={ "36011", "吉尼達爾殘骸", "要塞資源", "", "default", "NagrandTreasures","824"},
[72976212]={ "35590", "地精包裹", "要塞資源", "乘探險家拉祖克的滑翔翼到那裡 [這裡的東南方]", "default", "NagrandTreasures","824"},
[47207425]={ "35576", "地精包裹", "要塞資源", "乘探險家比伯斯的滑翔翼到那裡 [這裡的東方]", "default", "NagrandTreasures","824"},
[58285249]={ "35694", "金色卡利鳥蛋", "垃圾物品", "在樹中的巢", "default", "NagrandTreasures","118266"},
[38345872]={ "36109", "金趾的戰利品", "金錢", "鑰匙在鸚鵡上", "default", "NagrandTreasures",""},
[87107288]={ "36051", "灰喉的骨頭堆", "寵物 玩具", "", "default", "NagrandTreasures","118054"},
[87624498]={ "35622", "藏匿物", "要塞資源", "乘探險家Garix的滑翔翼到那裡 [這裡的北方]", "default", "NagrandTreasures","824"},
[67384906]={ "36039", "懸槌大錘", "i605 力量 戒指", "", "default", "NagrandTreasures","118252"},
[75236563]={ "36099", "重要的探索補給", "酒精飲料", "", "default", "NagrandTreasures","61986"},
[61765747]={ "36082", "遺失的吊墜", "i593 綠色頭盔", "", "default", "NagrandTreasures","116687"},
[70531385]={ "35643", "登山者的包裹", "要塞資源", "乘探險家達茲的滑翔翼到那裡 [這裡的西方]", "default", "NagrandTreasures","824"},
[80967979]={ "36049", "食人魔念珠", "i605 力量戒指", "", "default", "NagrandTreasures","118255"},
[57796205]={ "36115", "白鬼藥劑", "回魔藥水", "", "default", "NagrandTreasures","118278"},
[58295931]={ "36021", "波卡爾的第十三把斧子", "i605 單手 力量斧", "", "default", "NagrandTreasures","116688"},
[72716092]={ "36035", "拋光的刃牙虎人顱骨", "i605 敏捷/力量 戒指", "", "default", "NagrandTreasures","118254"},
[58507630]={ "900008", "探險家比伯斯的火箭", "沒什麼", "要求有探險家比伯斯", "rocket", "NagrandTreasures",""},
[75186494]={ "36102", "刃牙虎人儲物箱", "金錢", "", "default", "NagrandTreasures",""},
[89073313]={ "36857", "走私者的箱子", "要塞資源", "", "default", "NagrandTreasures","824"},
[40346864]={ "37435", "幽靈寶箱", "要塞資源", "", "default", "NagrandTreasures","824"},
[50128228]={ "35577", "熱砂補給品", "要塞資源", "乘探險家比伯斯的滑翔翼到那裡  [這裡的東北方]", "default", "NagrandTreasures","824"},
[52678008]={ "35583", "熱砂補給品", "要塞資源", "乘探險家比伯斯的滑翔翼到那裡  [這裡的北方]", "default", "NagrandTreasures","824"},
[77835195]={ "35591", "熱砂補給品", "要塞資源", "乘探險家拉祖克的滑翔翼到那裡 [這裡的南方]", "default", "NagrandTreasures","824"},
[64591762]={ "33648", "熱砂補給品", "要塞資源", "乘探險家達茲的滑翔翼到那裡  [這裡的東北方]", "default", "NagrandTreasures","824"},
[70601860]={ "35646", "熱砂補給品", "要塞資源", "乘探險家達茲的滑翔翼到那裡  [這裡的西北方]", "default", "NagrandTreasures","824"},
[87602028]={ "35662", "熱砂補給品", "要塞資源", "乘探險家倫佐的滑翔翼到那裡 [這裡的西南方]", "default", "NagrandTreasures","824"},
[88274262]={ "35616", "熱砂補給品", "要塞資源", "乘探險家Garix的滑翔翼到那裡 [這裡的西北方]", "default", "NagrandTreasures","824"},
[64716583]={ "36046", "塔拉防禦護盾", "i605 敏捷/智力 戒指", "", "default", "NagrandTreasures","118253"},
[37717065]={ "34760", "庫爾克羅什的寶藏", "要塞資源", "", "default", "NagrandTreasures","824"},
[49976651]={ "35579", "注靈水晶", "i613 雙手 力量劍", "乘探險家比伯斯的滑翔翼到那裡  [這裡的東南方]", "default", "NagrandTreasures","118264"},
[51726029]={ "35695", "戰歌寶箱", "要塞資源", "", "default", "NagrandTreasures","824"},
[52414438]={ "36073", "戰歌頭盔", "i609 鎖甲敏捷/智力 頭盔", "", "default", "NagrandTreasures","118250"},
[73047036]={ "35678", "戰歌保險箱", "要塞資源", "", "default", "NagrandTreasures","824"},
[76066990]={ "35682", "戰歌長矛", "垃圾物品", "乘探險家拉祖克的滑翔翼到那裡 [這裡的北方]", "default", "NagrandTreasures","118678"},
[80656054]={ "35593", "戰歌戰利品", "要塞資源", "乘探險家拉祖克的滑翔翼到那裡 [這裡的西方]", "default", "NagrandTreasures","824"},
[89406588]={ "35976", "戰歌補給品", "要塞資源", "", "default", "NagrandTreasures","824"},
[64763573]={ "36071", "防水袋", "20格包", "", "default", "NagrandTreasures","118235"},
[53386425]={ "36088", "Adventurer's Pouch", "隨機裝綁綠裝", "In a cave; entrance is to the east", "default", "NagrandTreasures","824"},
[35475725]={ "36846", "Spirit's Gift", "要塞資源", "", "default", "NagrandTreasures","824"},
--NagrandRares
[84605340]={ "35778", "先祖劍聖", "要塞資源", "", "rare", "NagrandRares","824"},
[51001600]={ "37210", "奧吉克森", "熱砂保護協會的聲望物品", "", "swprare", "NagrandSWP","118654"},
[62601680]={ "37211", "伯格魯", "熱砂保護協會的聲望物品", "", "swprare", "NagrandSWP","118655"},
[77006400]={ "35735", "狂暴T-300系列II型", "要塞資源", "在一個山洞內, 使用一個開關開啟", "rare", "NagrandRares","824"},
[40001600]={ "37396", "斷骨者", "未知", "!!! 等級100 !!!", "hundredrare", "NagrandHundred",""},
[43003640]={ "37400", "布魯塔格·利刃", "i620 智力/力量 鎧甲鞋", "", "hundredrare", "NagrandHundred","119380"},
[34607700]={ "34727", "鐵須隊長", "玩具 + i607 槍", "", "rare", "NagrandRares","118244"},
[64203000]={ "37221", "德克漢", "熱砂保護協會的聲望物品", "", "swprare", "NagrandSWP","118656"},
[60003800]={ "37222", "厄蹄", "熱砂保護協會的聲望物品", "", "swprare", "NagrandSWP","118657"},
[38602240]={ "37395", "杜格·碎脊者", "i620 敏捷 雙手錘", "", "hundredrare", "NagrandHundred","119405"},
[89004120]={ "35623", "探險家諾贊德 ", "垃圾物品", "", "rare", "NagrandRares","118679"},
[74801180]={ "35836", "鋸齒", "垃圾物品", "", "rare", "NagrandRares","116836"},
[70004180]={ "35893", "燧皮", "i609 力量盾", "", "rare", "NagrandRares","116807"},
[48202220]={ "37223", "野蠻的伽羅格", "熱砂保護協會的聲望物品", "", "swprare", "NagrandSWP","118658"},
[52205580]={ "35715", "加魯爾", "i605 飾品 雙擊 + Wolf 觸發", "", "rare", "NagrandRares","118246"},
[42207860]={ "34725", "加茲奧達", "i602 智力 戒指", "在洞穴內", "rare", "NagrandRares","116798"},
[66605660]={ "35717", "狂暴的瘤蹄", "i598 飾品 雙擊 + 敏捷觸發", "", "rare", "NagrandRares","116824"},
[93202820]={ "35898", "凝血瓣", "i602 敏捷/智力 皮甲手套", "這手套可以讓你在德拉諾採草快點", "rare", "NagrandRares","116916"},
[42003680]={ "37472", "戈爾塔格·鋼柄", "頂尖水晶", "通過使用秘密會議詳細物品的信號號角召喚", "hundredrare", "NagrandHundred",""},
[84603660]={ "36159", "砂齒", "i609 敏捷/智力 皮甲手腕", "", "rare", "NagrandRares","118689"},
[66805120]={ "35714", "巨羽", "i600 布甲胸", "", "rare", "NagrandRares","116795"},
[86007160]={ "35784", "灰喉", "i610 力量 披風", "", "rare", "NagrandRares","118687"},
[80603040]={ "35923", "獵手黑齒", "i609 敏捷 雙手錘", "", "rare", "NagrandRares","118245"},
[87005500]={ "34862", "亥伯裡奧斯", "i597 飾品 加速 +精通 觸發", "", "rare", "NagrandRares","116799"},
[45803480]={ "37399", "卡洛許·黑風", "i620 布甲腿", "", "hundredrare", "NagrandHundred","119355"},
[43803440]={ "37473", "克拉爾·亡眼", "頂尖水晶", "通過使用秘密會議詳細物品的信號號角召喚", "hundredrare", "NagrandHundred",""},
[58201200]={ "37398", "開膛者克魯德", "i620 智力/力量 鎧甲腰 +成就", "殺死他附近的15個小怪才能攻擊他", "hundredrare", "NagrandHundred","119384"},
[52009000]={ "37408", "萊納亞", "未知", "!!! 等級100 !!!", "hundredrare", "NagrandHundred",""},
[81206000]={ "35932", "馬爾洛克·裂石 ", "i597 敏捷法杖", "", "rare", "NagrandRares","116796"},
[45801520]={ "36229", "老鉗子先生", "i616 飾品 雙擊 + Lobstrok 觸發", "", "rare", "NagrandRares","118690"},
[34005100]={ "37224", "穆格拉", "熱砂保護協會的聲望物品", "", "swprare", "NagrandSWP","118659"},
[47607080]={ "35865", "靈魔", "寵物", "", "rare", "NagrandRares","116815"},
[42804920]={ "35875", "奧菲斯", "i602 布甲腿", "", "rare", "NagrandRares","116765"},
[61806900]={ "35943", "偵察騎兵杜莉薩", "i598 敏捷/智力 皮甲鞋", "", "rare", "NagrandRares","116800"},
[58201800]={ "37637", "競技場野獸", "i620 敏捷/力量 坦克披風", "", "hundredrare", "NagrandHundred","823"},
[38001960]={ "37397", "深淵殺手", "i620 力量 戒指", "", "hundredrare", "NagrandHundred","119389"},
[73605780]={ "35712", "狂野的赤爪", "i604 智力拳套", "", "rare", "NagrandRares","118243"},
[58008400]={ "35900", "魯克拉", "i608 智力/力量 鎧甲肩", "", "rare", "NagrandRares","118688"},
[54806120]={ "35931", "斥候波卡爾", "i601 力量 單手斧", "", "rare", "NagrandRares","116797"},
[60934775]={ "35912", "西恩·懷特斯", "i600 敏捷/智力 皮甲腰", "當被遺棄的寶箱拾取時出現", "rare", "NagrandRares","116834"},
[75606500]={ "36128", "靈牙", "i597 智力劍", "", "rare", "NagrandRares","116806"},
[58403580]={ "37225", "泰克塔倫", "熱砂保護協會的聲望物品", "", "swprare", "NagrandSWP","118660"},
[65003900]={ "35920", "圖拉卡", "i609 敏捷 披風", "", "rare", "NagrandRares","116814"},
[37003800]={ "37520", "邪爪", "熱砂保護協會的聲望物品", "", "swprare", "NagrandSWP","120172"},
[82607620]={ "34645", "戰爭大師布格索爾", "i600 力量/智力 鎧甲手腕", "", "rare", "NagrandRares","116805"},
[70602940]={ "35877", "喚風者科拉斯特", "i598 法術法杖", "", "rare", "NagrandRares","116808"},
[41004400]={ "37226", "澤加納克", "熱砂保護協會的聲望物品", "", "swprare", "NagrandSWP","118661"},
}
nodes["TanaanJungle"] = {
--TanaanJungleRares
[41407960]={ "37407", "Keravnos", "unknown", "", "hundredrare", "TanaanHundred",""},
}
nodes["garrisonsmvalliance_tier1"] = {
[49604380]={ "35530", "墜月鳥蛋", "要塞資源", "在一輛貨車上", "default", "SMVTreasures","824"},
[42405436]={ "35381", "皮皮埋藏的補給品 1", "要塞資源", "", "default", "SMVTreasures","824"},
[50704850]={ "35382", "皮皮埋藏的補給品 2", "要塞資源", "", "default", "SMVTreasures","824"},
[30802830]={ "35383", "皮皮埋藏的補給品 3", "要塞資源", "", "default", "SMVTreasures","824"},
[49197683]={ "35384", "皮皮埋藏的補給品 4", "要塞資源", "", "default", "SMVTreasures","824"},
[51800110]={ "35289", "斯帕克的失竊補給", "要塞資源", "在湖中的洞穴中", "default", "SMVTreasures","824"},
 }
nodes["garrisonsmvalliance_tier2"] = {
[37306590]={ "35530", "墜月鳥蛋", "要塞資源", "在一輛貨車上", "default", "SMVTreasures","824"},
[41685803]={ "35381", "皮皮埋藏的補給品 1", "要塞資源", "", "default", "SMVTreasures","824"},
[51874545]={ "35382", "皮皮埋藏的補給品 2", "要塞資源", "", "default", "SMVTreasures","824"},
[34972345]={ "35383", "皮皮埋藏的補給品 3", "要塞資源", "", "default", "SMVTreasures","824"},
[46637608]={ "35384", "皮皮埋藏的補給品 4", "要塞資源", "", "default", "SMVTreasures","824"},
[51800110]={ "35289", "斯帕克的失竊補給", "要塞資源", "在湖中的洞穴中", "default", "SMVTreasures","824"},
 }
nodes["garrisonsmvalliance_tier3"] = {
[61277261]={ "35530", "墜月鳥蛋", "要塞資源", "在帳篷裡", "default", "SMVTreasures","824"},
[60575515]={ "35381", "皮皮埋藏的補給品 1", "要塞資源", "", "default", "SMVTreasures","824"},
[37307491]={ "35382", "皮皮埋藏的補給品 2", "要塞資源", "", "default", "SMVTreasures","824"},
[37864378]={ "35383", "皮皮埋藏的補給品 3", "要塞資源", "", "default", "SMVTreasures","824"},
[61527154]={ "35384", "皮皮埋藏的補給品 4", "要塞資源", "", "default", "SMVTreasures","824"},
[51800110]={ "35289", "斯帕克的失竊補給", "要塞資源", "在湖中的洞穴中", "default", "SMVTreasures","824"},
 } 
nodes["garrisonffhorde_tier1"] = {
[74505620]={ "34937", "塞娜小姐的備用物資", "要塞資源", "", "default", "FFRTreasures","824"},
}
nodes["garrisonffhorde_tier2"] = {
[74505620]={ "34937", "塞娜小姐的備用物資", "要塞資源", "", "default", "FFRTreasures","824"},
}
nodes["garrisonffhorde_tier3"] = {
[74505620]={ "34937", "塞娜小姐的備用物資", "要塞資源", "", "default", "FFRTreasures","824"},
}
if (IsQuestFlaggedCompleted(36249) or IsQuestFlaggedCompleted(36250)) then
--Gorgrond Lumber Mill is active if either of these Quest IDs are true
nodes["Gorgrond"][49074846]={ "950000", "陳年的石箱", "", "QuestID is missing, will stay active until manually disabled", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][42345477]={ "36003", "陳年的石箱", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][47514363]={ "36717", "陳年的石箱", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][53354679]={ "35701", "古老的泰坦寶箱", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][50155376]={ "35984", "古老的泰坦寶箱", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][42084607]={ "36720", "古老的泰坦寶箱", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][41988155]={ "35982", "波塔尼精華種子", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][49657883]={ "35968", "被遺忘的食人魔寶箱", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][47016905]={ "35971", "被遺忘的骷髏寶箱", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][45808931]={ "36019", "被遺忘的骷髏寶箱", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][39335627]={ "36716", "被遺忘的骷髏寶箱", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][56745727]={ "35965", "神秘的石化豆荚", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][41147726]={ "35980", "神秘的石化豆荚", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][60507276]={ "36015", "神秘的石化豆荚", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][63285719]={ "36430", "神秘的石化豆荚", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][47647679]={ "36714", "神秘的石化豆荚", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][51756909]={ "36715", "神秘的石化豆荚", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][40956732]={ "35979", "黑曜石水晶簇", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][45969357]={ "35975", "探險家工程師Toldirk Ashlamp的遺骸", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][51806148]={ "35966", "Grimnir Ashpick的遺骸", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][51647226]={ "35967", "未知的石化蛋", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][45318195]={ "35981", "未知的石化蛋", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][42914350]={ "36001", "未知的石化蛋", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][53007906]={ "36713", "未知的石化蛋", "", "", "default", "GorgrondLumber","824"}
nodes["Gorgrond"][47245180]={ "36718", "未知的石化蛋", "", "", "default", "GorgrondLumber","824"}
end
if (IsQuestFlaggedCompleted(36251) or IsQuestFlaggedCompleted(36252)) then
--Gorgrond Sparring Arena is active if either of these Quest IDs are true
nodes["Gorgrond"][45634931]={ "36722", "陳年的石箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][43224574]={ "36723", "陳年的石箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][41764527]={ "36726", "陳年的石箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][48115516]={ "36730", "陳年的石箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][51334055]={ "36734", "陳年的石箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][46056305]={ "36736", "陳年的石箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][58125146]={ "36739", "陳年的石箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][59567275]={ "36781", "陳年的石箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][45748821]={ "36784", "陳年的石箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][45544298]={ "36733", "古老的食人魔寶箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][45076993]={ "36737", "古老的食人魔寶箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][61555855]={ "36740", "古老的食人魔寶箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][54257313]={ "36782", "古老的食人魔寶箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][42179308]={ "36787", "古老的食人魔寶箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][41528652]={ "36789", "古老的食人魔寶箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][49425084]={ "36710", "古老的泰坦寶箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][42195203]={ "36727", "古老的泰坦寶箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][43365169]={ "36731", "古老的泰坦寶箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][47923998]={ "36735", "古老的泰坦寶箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][50326658]={ "36738", "古老的泰坦寶箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][49128248]={ "36783", "古老的泰坦寶箱", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][48114638]={ "36721", "黑曜石水晶簇", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][41855889]={ "36728", "黑曜石水晶簇", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][42056429]={ "36729", "黑曜石水晶簇", "", "", "default", "GorgrondBoulder","824"}
nodes["Gorgrond"][44184665]={ "36732", "黑曜石水晶簇", "", "", "default", "GorgrondBoulder","824"}
end
if (PlayerFaction == "Alliance") then
nodes["ShadowmoonValleyDR"][29600620]={ "35281", "Bahameye", "火焰菊石", "", "rare", "SMVRares","111666"}
nodes["Gorgrond"][60805400]={ "36502", "拜奧蘭特", "加經驗值的任務物品", "在這個元素從地圖去除前，您必須完成任務", "rare", "GorgrondRares","116159"}
nodes["Gorgrond"][46004680]={ "35816", "查爾·恐翼", "加經驗值的任務物品", "在這個元素從地圖去除前，您必須完成任務", "rare", "GorgrondRares","113457"}
nodes["Gorgrond"][42805920]={ "35812", "火山領主伊格尼斯", "加經驗值的任務物品", "在這個元素從地圖去除前，您必須完成任務", "rare", "GorgrondRares","113449"}
nodes["Gorgrond"][40505100]={ "35809", "“死水”德斯克斯", "加經驗值的任務物品", "在這個元素從地圖去除前，您必須完成任務", "rare", "GorgrondRares","113446"}
nodes["Gorgrond"][51804160]={ "35808", "暴虐的艾羅薩恩", "加經驗值的任務物品", "在這個元素從地圖去除前，您必須完成任務", "rare", "GorgrondRares","113445"}
nodes["Gorgrond"][58006360]={ "35813", "真菌守衛者", "加經驗值的任務物品", "在這個元素從地圖去除前，您必須完成任務", "rare", "GorgrondRares","113453"}
nodes["ShadowmoonValleyDR"][21603300]={ "33664", "Gorum", "i516 敏捷/智力 戒指", "Inside Bloodthorn Cave - Spawns at the Ceiling", "rare", "SMVRares","113082"}
nodes["Gorgrond"][52406580]={ "35820", "吞噬者卡加克斯", "加經驗值的任務物品", "在這個元素從地圖去除前，您必須完成任務", "rare", "GorgrondRares","113461"}
nodes["ShadowmoonValleyDR"][30301990]={ "35530", "Lunarfall Egg", "要塞資源", "Changes position to inside the garrison once it is built", "default", "SMVTreasures","824"}
nodes["Gorgrond"][51206360]={ "35817", "“天空魔王”洛爾丹", "加經驗值的任務物品", "周圍很多的蒼蠅, 坐標只是在他的路線中的一處！在這個元素從地圖去除前，您必須完成任務", "rare", "GorgrondRares","113458"}
nodes["ShadowmoonValleyDR"][42804100]={ "33038", "Windfang Matriarch", "i516 敏捷/力量 單手劍", "Is part of the Embaari Crystal Defense Event", "rare", "SMVRares","113553"}
end
if (PlayerFaction == "Horde") then
nodes["Gorgrond"][60805400]={ "36503", "拜奧蘭特", "加經驗值的任務物品", "在這個元素從地圖去除前，您必須完成任務", "rare", "GorgrondRares","116160"}
nodes["Gorgrond"][46004680]={ "35815", "查爾·恐翼", "加經驗值的任務物品", "在這個元素從地圖去除前，您必須完成任務", "rare", "GorgrondRares","113456"}
nodes["Gorgrond"][42805920]={ "35811", "火山領主伊格尼斯", "加經驗值的任務物品", "在這個元素從地圖去除前，您必須完成任務", "rare", "GorgrondRares","113448"}
nodes["Gorgrond"][40505100]={ "35810", "“死水”德斯克斯", "加經驗值的任務物品", "在這個元素從地圖去除前，您必須完成任務", "rare", "GorgrondRares","113447"}
nodes["Gorgrond"][51804160]={ "35807", "暴虐的艾羅薩恩", "加經驗值的任務物品", "在這個元素從地圖去除前，您必須完成任務", "rare", "GorgrondRares","113444"}
nodes["Gorgrond"][58006360]={ "35814", "真菌守衛者", "加經驗值的任務物品", "在這個元素從地圖去除前，您必須完成任務", "rare", "GorgrondRares","113454"}
nodes["Gorgrond"][52406580]={ "35819", "吞噬者卡加克斯", "加經驗值的任務物品", "在這個元素從地圖去除前，您必須完成任務", "rare", "GorgrondRares","113460"}
nodes["Gorgrond"][51206360]={ "35818", "“天空魔王”洛爾丹", "加經驗值的任務物品", "周圍很多的蒼蠅, 坐標只是在他的路線中的一處！在這個元素從地圖去除前，您必須完成任務", "rare", "GorgrondRares","113459"}
nodes["Talador"][61107170]={ "34116", "Norana的寶箱", "i564 敏捷項鍊", "", "default", "TaladorTreasures","117563"}
end
 
 function GetItem(ID)
	if (ID == "824" or ID == "823") then
		local currency, _, _ = GetCurrencyInfo(ID)
		if (currency ~= nil) then
			return currency
		else
			return "貨幣ID載入錯誤"
		end
	else
		local _, item, _, _, _, _, _, _, _, _ = GetItemInfo(ID)
		if (item ~= nil) then
			return item
		else
			return "物品ID載入錯誤"
		end
	end
end	
 function GetIcon(ID)
	if (ID == "824" or ID == "823") then
		local _, _, icon = GetCurrencyInfo(ID)
		if (icon ~= nil) then
			return icon
		else
			return "Interface\\Icons\\inv_misc_questionmark"
		end
	else
		local _, _, _, _, _, _, _, _, _, icon = GetItemInfo(ID)
		if (icon ~= nil) then
			return icon
		else
			return "Interface\\Icons\\inv_misc_questionmark"
		end
	end
end	
function DraenorTreasures:OnEnter(mapFile, coord)
    if (not nodes[mapFile][coord]) then return end
	
	local tooltip = self:GetParent() == WorldMapButton and WorldMapTooltip or GameTooltip
	if ( self:GetCenter() > UIParent:GetCenter() ) then
		tooltip:SetOwner(self, "ANCHOR_LEFT")
	else
		tooltip:SetOwner(self, "ANCHOR_RIGHT")
	end
	tooltip:SetText(nodes[mapFile][coord][2])
	if (nodes[mapFile][coord][3] ~= nil) and (DraenorTreasures.db.profile.show_loot == true) then
		if ((nodes[mapFile][coord][7] ~= nil) and (nodes[mapFile][coord][7] ~= "")) then
			tooltip:AddLine(("掉落: " .. GetItem(nodes[mapFile][coord][7])), nil, nil, nil, true)
			if ((nodes[mapFile][coord][3] ~= nil) and (nodes[mapFile][coord][3] ~= "")) then
				tooltip:AddLine(("掉落資訊: " .. nodes[mapFile][coord][3]), nil, nil, nil, true)
			end
		else
			tooltip:AddLine(("掉落: " .. nodes[mapFile][coord][3]), nil, nil, nil, true)
		end
		
	end
	if (nodes[mapFile][coord][4] ~= "") and (DraenorTreasures.db.profile.show_notes == true) then
	 tooltip:AddLine(("註記: " .. nodes[mapFile][coord][4]), nil, nil, nil, true)
	end
	tooltip:Show()
end

local isMoving = false
local info = {}
local clickedMapFile = nil
local clickedCoord = nil
local function generateMenu(button, level)
	if (not level) then return end
	for k in pairs(info) do info[k] = nil end
	if (level == 1) then
	
		info.isTitle      = 1
		info.text         = "德拉諾財寶"
		info.notCheckable = 1
		UIDropDownMenu_AddButton(info, level)
		
		info.disabled     = nil
		info.isTitle      = nil
		info.notCheckable = nil
		info.text = "從此地圖刪除此物件"
		info.func = DisableTreasure
		info.arg1 = clickedMapFile
		info.arg2 = clickedCoord
		UIDropDownMenu_AddButton(info, level)
		
		if isTomTomloaded == true then
			info.text = "增加此位置到TomTom路徑點"
			info.func = addtoTomTom
			info.arg1 = clickedMapFile
			info.arg2 = clickedCoord
			UIDropDownMenu_AddButton(info, level)
		end

		info.text         = CLOSE
		info.func         = function() CloseDropDownMenus() end
		info.arg1         = nil
		info.arg2         = nil
		info.notCheckable = 1
		UIDropDownMenu_AddButton(info, level)

		info.text         = "恢復刪除的物件"
		info.func         = ResetDB
		info.arg1         = nil
		info.arg2         = nil
		info.notCheckable = 1
		UIDropDownMenu_AddButton(info, level)
		
		end
	end
local HandyNotes_DraenorTreasuresDropdownMenu = CreateFrame("Frame", "HandyNotes_DraenorTreasuresDropdownMenu")
HandyNotes_DraenorTreasuresDropdownMenu.displayMode = "MENU"
HandyNotes_DraenorTreasuresDropdownMenu.initialize = generateMenu

function DraenorTreasures:OnClick(button, down, mapFile, coord)
		if button == "RightButton" and down then
			clickedMapFile = mapFile
			clickedCoord = coord
			ToggleDropDownMenu(1, nil, HandyNotes_DraenorTreasuresDropdownMenu, self, 0, 0)
		end
	end

	
function DraenorTreasures:OnLeave(mapFile, coord)
	if self:GetParent() == WorldMapButton then
		WorldMapTooltip:Hide()
	else
		GameTooltip:Hide()
	end
end

local options = {
 type = "group",
 name = "德拉諾財寶",
 desc = "德拉諾財寶位置。",
get = function(info) return DraenorTreasures.db.profile[info.arg] end,
set = function(info, v) DraenorTreasures.db.profile[info.arg] = v; DraenorTreasures:Refresh() end,
 args = {
   desc = {
   name = "一般設定",
   type = "description",
   order = 0,
  },
   icon_scale_treasures = {
   type = "range",
   name = "財寶圖示大小",
   desc = "圖示的大小",
   min = 0.25, max = 3, step = 0.01,
   arg = "icon_scale_treasures",
   order = 1,
  },
  icon_scale_rares = {
   type = "range",
   name = "稀有圖示大小",
   desc = "圖示的大小",
   min = 0.25, max = 3, step = 0.01,
   arg = "icon_scale_rares",
   order = 2,
  },
  icon_alpha = {
   type = "range",
   name = "圖示透明度",
   desc = "圖示的透明度",
   min = 0, max = 1, step = 0.01,
   arg = "icon_alpha",
   order = 20,
  },

  VisibilityOptions = {
  type = "group",
  name = "可見性設定",
  desc = "可見性設定",
  args = {


VisibilityGroup = {
	type = "group",
	order = 0,
	name = "選擇哪些區域要顯示什麼:",
	inline = true,
	args = {
SMVGroup = {
	name = "影月谷",
	desc = "Shadowmoon Valley",
	type = "header",
	order = 0,
	},
SMVTreasures = {
   type = "toggle",
   name = "財寶",
   arg = "SMVTreasures",
   order = 1,
   width = "half",
  },
SMVRares = {
   type = "toggle",
   name = "稀有",
   arg = "SMVRares",
   order = 2,
   width = "half",
  },
SMVHundredRares = {
   type = "toggle",
   name = "100等稀有",
   desc = "等級100稀有出現地點",
   arg = "SMVHundred",
   order = 3,
   width = "half",
  },
SMVShrines = {
   type = "toggle",
   name = "聖壇",
   arg = "SMVShrine",
   order = 4,
   width = "half",
  },
FFRGroup = {
	name = "霜火峰",
	desc = "霜火峰",
	type = "header",
	order = 10,
	},	
FFRTreasures = {
   type = "toggle",
   name = "財寶",
   arg = "FFRTreasures",
   width = "half",
   order = 11,
  },
FFRBF = {
   type = "toggle",
   name = "劍刃",
   desc = "劍刃堡壘中的財寶",
   arg = "FFRBF",
   width = "half",
   order = 12,
  },
FFRRares = {
   type = "toggle",
   name = "稀有",
   arg = "FFRRares",
   width = "half",
   order = 13,
  },
FFRHundredRares = {
   type = "toggle",
   name = "100等稀有",
   desc = "等級100稀有出現地點",
   arg = "FFRHundred",
   width = "half",
   order = 14,
  },
FFRShrines = {
   type = "toggle",
   name = "聖壇",
   arg = "FFRShrine",
   order = 15,
   width = "half",
  },
GorgrondGroup = {
	name = "格古隆德",
	desc = "格古隆德",
	type = "header",
	order = 20,
	},	
GorgrondTreasures = {
   type = "toggle",
   name = "財寶",
   arg = "GorgrondTreasures",
   width = "half",
   order = 21,
  },
GorgrondRares = {
   type = "toggle",
   name = "稀有",
   arg = "GorgrondRares",
   width = "half",
   order = 22,
  },  
GorgrondHundredRares = {
   type = "toggle",
   name = "100等稀有",
   arg = "GorgrondHundred",
   desc = "等級100稀有出現地點",
   width = "normal",
   order = 23,
  },  
GorgrondLumber = {
   type = "toggle",
   name = "鋸木廠財寶",
   arg = "GorgrondLumber",
   desc = "鋸木廠財寶",
   width = "normal",
   order = 24,
  },  
GorgrondBoulder = {
   type = "toggle",
   name = "搏擊競技場財寶",
   arg = "GorgrondBoulder",
   desc = "搏擊競技場財寶",
   width = "normal",
   order = 25,
  },  
TaladorGroup = {
	name = "塔拉多爾",
	desc = "塔拉多爾",
	type = "header",
	order = 30,
	},	
TaladorTreasures = {
   type = "toggle",
   name = "財寶",
   arg = "TaladorTreasures",
   width = "half",
   order = 31,
  },
TaladorRares = {
   type = "toggle",
   name = "稀有",
   arg = "TaladorRares",
   width = "half",
   order = 32,
  },  
TaladorHundredRares = {
   type = "toggle",
   name = "100等稀有",
   arg = "TaladorHundred",
   desc = "等級100稀有出現地點",
   width = "normal",
   order = 33,
  },  
SoAGroup = {
	name = "阿拉卡山",
	desc = "阿拉卡山",
	type = "header",
	order = 40,
	},	  
SoATreasures = {
   type = "toggle",
   name = "財寶",
   arg = "SoATreasures",
   width = "half",
   order = 41,
  },
SoARares = {
   type = "toggle",
   name = "稀有",
   arg = "SoARares",
   width = "half",
   order = 42,
  },  
SoAHundredRares = {
   type = "toggle",
   name = "100等稀有",
   desc = "等級100稀有出現地點",
   arg = "SoAHundred",
   width = "half",
   order = 43,
  },  
SoAArchaeology = {
   type = "toggle",
   name = "SoA考古",
   desc = "考古財寶",
   arg = "SoAArchaeology",
   width = "half",
   order = 44,
},  
NagrandGroup = {
	name = "納葛蘭",
	desc = "納葛蘭",
	type = "header",
	order = 50,
	},	    
  NagrandTreasures = {
   type = "toggle",
   name = "財寶",
   arg = "NagrandTreasures",
   width = "half",
   order = 51,
  },
  NagrandRares = {
   type = "toggle",
   name = "稀有",
   arg = "NagrandRares",
   width = "half",
   order = 52,
  },
  NagrandHundredRares = {
   type = "toggle",
   name = "100等稀有",
   arg = "NagrandHundred",
   desc = "等級100稀有出現地點",
   width = "half",
   order = 53,
  },
  NagrandSWPRares = {
   type = "toggle",
   name = "SWP 稀有",
   desc = "熱砂保護協會 稀有",
   arg = "NagrandSWP",
   width = "half",
   order = 54,
  },
 TanaanGroup = {
	name = "塔南森林",
	desc = "塔南森林",
	type = "header",
	order = 55,
	},	
TanaanHundredRares = {
   type = "toggle",
   name = "100等稀有",
   arg = "TanaanHundred",
   desc = "等級100稀有出現地點",
   width = "normal",
   order = 56,
  },  
	},
  },
  alwaysshow = {
   type = "toggle",
   name = "仍然顯示已經拾取(擊殺)的 財寶(稀有)",
   desc = "顯示每個財寶/稀有不論拾取狀態",
   arg = "alwaysshow",
   order = 100,
   width = "full",
  },
    show_loot = {
   type = "toggle",
   name = "顯示掉落",
   desc = "顯示每個財寶/稀有的掉落",
   arg = "show_loot",
   order = 101,
   },
  show_notes = {
   type = "toggle",
   name = "顯示註記",
   desc = "顯示每個財寶/稀有的註記如果可用的話",
   arg = "show_notes",
   order = 101,
   },
	 },
	},
  },
}

function DraenorTreasures:OnInitialize()
 local defaults = {
  profile = {
   icon_scale_treasures = 1.5,
   icon_scale_rares = 2.0,
   icon_alpha = 1.00,
   alwaysshow = false,
   save = true,
   SMVTreasures = true,
   SMVRares = true,
   SMVHundred = true,
   SMVShrine = true,
   FFRTreasures = true,
   FFRRares = true,
   FFRHundred = true,
   FFRShrine = true,
   FFRBF = false,
   GorgrondTreasures = true,
   GorgrondRares = true,
   GorgrondHundred = true,
   GorgrondLumber = true,
   GorgrondBoulder = true,
   TaladorTreasures = true,
   TaladorRares = true,
   TaladorHundred = true,
   SoATreasures = true,
   SoARares = true,
   SoAHundred = true,
   SoAArchaeology = true,
   NagrandTreasures = true,
   NagrandRares = true,
   NagrandHundred = true,
   NagrandSWP = true,
   TanaanHundred = true,
   show_loot = true,
   show_notes = true,
  },
 }

 self.db = LibStub("AceDB-3.0"):New("DraenorTreasuresDB", defaults, "Default")
 self:RegisterEvent("PLAYER_ENTERING_WORLD", "WorldEnter")
end

function DraenorTreasures:WorldEnter()
 self:UnregisterEvent("PLAYER_ENTERING_WORLD")
 self:ScheduleTimer("ShadowElixirs", 5)
 self:ScheduleTimer("RegisterWithHandyNotes", 8)
end

function DraenorTreasures:ShadowElixirs()
do
	if ((IsQuestFlaggedCompleted(36386) == false) or (IsQuestFlaggedCompleted(36390) == false) or (IsQuestFlaggedCompleted(36389) == false) or (IsQuestFlaggedCompleted(36392) == false) or (IsQuestFlaggedCompleted(36388) == false) or (IsQuestFlaggedCompleted(36381) == false)) then
		nodes["SpiresOfArak"][43901500]={ "36395", "暗影視界藥劑 1", "暗影視界藥劑", "藥劑可以使用在泰洛卡聖壇以得到6個裝等585武器其中之一 (參見安祖之賜) 一但您拾取所有安祖之賜後物件會立刻被刪除", "default", "SoATreasures","115463"}
		nodes["SpiresOfArak"][43802470]={ "36397", "暗影視界藥劑 2", "暗影視界藥劑", "藥劑可以使用在泰洛卡聖壇以得到6個裝等585武器其中之一 (參見安祖之賜) 一但您拾取所有安祖之賜後物件會立刻被刪除", "default", "SoATreasures","115463"}
		nodes["SpiresOfArak"][69204330]={ "36398", "暗影視界藥劑 3", "暗影視界藥劑", "藥劑可以使用在泰洛卡聖壇以得到6個裝等585武器其中之一 (參見安祖之賜) 一但您拾取所有安祖之賜後物件會立刻被刪除", "default", "SoATreasures","115463"}
		nodes["SpiresOfArak"][48906250]={ "36399", "暗影視界藥劑 4", "暗影視界藥劑", "藥劑可以使用在泰洛卡聖壇以得到6個裝等585武器其中之一 (參見安祖之賜) 一但您拾取所有安祖之賜後物件會立刻被刪除", "default", "SoATreasures","115463"}
		nodes["SpiresOfArak"][55602200]={ "36400", "暗影視界藥劑 5", "暗影視界藥劑", "藥劑可以使用在泰洛卡聖壇以得到6個裝等585武器其中之一 (參見安祖之賜) 一但您拾取所有安祖之賜後物件會立刻被刪除", "default", "SoATreasures","115463"}
		nodes["SpiresOfArak"][53108450]={ "36401", "暗影視界藥劑 6", "暗影視界藥劑", "藥劑可以使用在泰洛卡聖壇以得到6個裝等585武器其中之一 (參見安祖之賜) 一但您拾取所有安祖之賜後物件會立刻被刪除", "default", "SoATreasures","115463"}
	end
end
end

function DraenorTreasures:RegisterWithHandyNotes()
do
	local function iter(t, prestate)
		if not t then return nil end
		local state, value = next(t, prestate)
		while state do
			    -- QuestID[1], Name[2], Loot[3], Notes[4], Icon[5], Tag[6],物品ID[7]
			    if (value[1] and self.db.profile[value[6]] and not DraenorTreasures:HasBeenLooted(value)) then
					if ((value[5] == "default") or (value[5] == "unknown")) then
						if ((value[7] ~= nil) and (value[7] ~= "")) then
							return state, nil, GetIcon(value[7]), DraenorTreasures.db.profile.icon_scale_treasures, DraenorTreasures.db.profile.icon_alpha
						else
							GetIcon(value[7]) --this should precache the物品, so that the loot is correctly returned
							return state, nil, iconDefaults[value[5]], DraenorTreasures.db.profile.icon_scale_treasures, DraenorTreasures.db.profile.icon_alpha
						end
					end
				if ((value[7] ~= nil) and (value[7] ~= "")) then
				 	GetIcon(value[7]) --this should precache the物品, so that the loot is correctly returned
				end
				 return state, nil, iconDefaults[value[5]], DraenorTreasures.db.profile.icon_scale_rares, DraenorTreasures.db.profile.icon_alpha
				end
			state, value = next(t, state)
		end
	end
	function DraenorTreasures:GetNodes(mapFile, isMinimapUpdate, dungeonLevel)
		return iter, nodes[mapFile], nil
	end
end
 HandyNotes:RegisterPluginDB("DraenorTreasures", self, options)
 self:RegisterBucketEvent({ "LOOT_CLOSED" }, 2, "Refresh")
 self:Refresh()
end
 
function DraenorTreasures:Refresh()
 self:SendMessage("HandyNotes_NotifyUpdate", "DraenorTreasures")
end

function ResetDB()
	table.wipe(DraenorTreasures.db.char)
	DraenorTreasures:Refresh()
end

function DraenorTreasures:HasBeenLooted(value)
if (self.db.profile.alwaysshow) then return false end
if (DraenorTreasures.db.char[value[1]] and self.db.profile.save) then return true end
if (IsQuestFlaggedCompleted(value[1])) then
	return true
end
return false
end

function DisableTreasure(button, mapFile, coord)
	if (nodes[mapFile][coord][1] ~= nil) then
		DraenorTreasures.db.char[nodes[mapFile][coord][1]] = true;
	end
	DraenorTreasures:Refresh()
end
function addtoTomTom(button, mapFile, coord)
	if isTomTomloaded == true then
		local mapId = HandyNotes:GetMapFiletoMapID(mapFile)
		local x, y = HandyNotes:getXY(coord)
		local desc = nodes[mapFile][coord][2];
        if (nodes[mapFile][coord][3] ~= nil) and (DraenorTreasures.db.profile.show_loot == true) then
            if ((nodes[mapFile][coord][7] ~= nil) and (nodes[mapFile][coord][7] ~= "")) then
                desc = desc.."\n掉落: " .. GetItem(nodes[mapFile][coord][7]);
                desc = desc.."\n掉落資訊: " .. nodes[mapFile][coord][3];
            else
                desc = desc.."\n掉落: " .. nodes[mapFile][coord][3];
            end
        end
        if (nodes[mapFile][coord][4] ~= "") and (DraenorTreasures.db.profile.show_notes == true) then
            desc = desc.."\n註記: " .. nodes[mapFile][coord][4]
        end
		TomTom:AddMFWaypoint(mapId, nil, x, y, {
			title = desc,
			persistent = nil,
			minimap = true,
			world = true
		})
	end
end